{
    "version": "https://jsonfeed.org/version/1",
    "title": "Damien Burke",
    "home_page_url": "http://damienburke.com/",
    "feed_url": "http://damienburke.com/feed.json",
    "description": null,
    "icon": "http://damienburke.com/apple-touch-icon.png",
    "favicon": "http://damienburke.com/favicon.ico",
    "expired": false,
    "items": [
    
        {
            "id": "http://damienburke.com/child-mind-institute",
            "title": "The California Healthy Minds, Thriving Kids Project",
            "summary": null,
            "content_text": "I am very proud to be part of this project at the Child Mind Institute to teachcritical mental health and coping skills.You can see me practicingmindfulnessas Hedgie in the fifth video of the series.Check out the rest of the seriesto learn evidence-based, clinically-proven mental health skills.",
            "content_html": "<p>I am very proud to be part of this project at the Child Mind Institute to teachcritical mental health and coping skills.</p><p>You can see me practicing<a href=\"https://childmind.org/healthyminds/mindfulness-parents-elementary/\">mindfulness</a>as Hedgie in the fifth video of the series.</p><p>Check out the rest of <a href=\"https://childmind.org/healthyminds/parents/\">the series</a>to learn evidence-based, clinically-proven mental health skills.</p>",
            "url": "http://damienburke.com/child-mind-institute",
            
            
            
            
            
            "date_published": "2022-01-20T00:00:00-08:00",
            "date_modified": "2022-01-20T00:00:00-08:00",
            "author": {
                "name": ""
            }
        },
    
        {
            "id": "http://damienburke.com/dream-groundbreaking",
            "title": "Groundbreaking for The Dream @ Tamarind South",
            "summary": null,
            "content_text": "On October 15, 2017 I was offered the opportunity to say a few words atthe groundbreaking ceremony for The Dream @ Tamarind South, a 32-unitbuilding at 1310 Tamarind Avenue.These are the remarks I prepared:There are over fifteen hundred people in Hollywood who are homeless.1Fifteen hundred men, women, and children; fifteen hundred of our neighborsin this small community are without a safe place to sleep at night.Even more of our neighbors are at risk of homelessness; housing in LosAngeles is the most unaffordable in the country.2But with projects like this one that we can increase the supply of housingand mitigate the unaffordability crisis and homelessness crisis we arefacing in Hollywood and in Los Angeles.Projects like the Dream at Tamarind are a key part of keeping Hollywood anexciting, dynamic place where anyone can make it big.Multi-unit buildings near job and transit centers allow lower-incomefamilies to live here in Hollywood, a region with excellent job and careerprospects that are only getting better.It allows them to work at those jobs without the long car commutes thatcause smog, noise, traffic congestion, stress, time away from families,and roadway death.3So on behalf of myself, my neighborhood, and the community at largeI would like to thank the Strategic Legacy Investment Group and everyoneelse that has been involved in bringing this project and projects like itto Hollywood. Thank you, and we look forward many more.            Greater Los Angeles Homeless Count &#8617;              Curbed LA article on report from UCLA Anderson School of Management &#8617;              Housing Development Toolkit &#8617;      ",
            "content_html": "<p>On October 15, 2017 I was offered the opportunity to say a few words atthe groundbreaking ceremony for The Dream @ Tamarind South, a 32-unitbuilding at 1310 Tamarind Avenue.</p><p>These are the remarks I prepared:</p><p>There are over fifteen hundred people in Hollywood who are homeless.<sup id=\"fnref:1\" role=\"doc-noteref\"><a href=\"#fn:1\" class=\"footnote\" rel=\"footnote\">1</a></sup>Fifteen hundred men, women, and children; fifteen hundred of our neighborsin this small community are without a safe place to sleep at night.</p><p>Even more of our neighbors are at risk of homelessness; housing in LosAngeles is the most unaffordable in the country.<sup id=\"fnref:2\" role=\"doc-noteref\"><a href=\"#fn:2\" class=\"footnote\" rel=\"footnote\">2</a></sup></p><p>But with projects like this one that we can increase the supply of housingand mitigate the unaffordability crisis and homelessness crisis we arefacing in Hollywood and in Los Angeles.</p><p>Projects like the Dream at Tamarind are a key part of keeping Hollywood anexciting, dynamic place where anyone can make it big.</p><p>Multi-unit buildings near job and transit centers allow lower-incomefamilies to live here in Hollywood, a region with excellent job and careerprospects that are only getting better.</p><p>It allows them to work at those jobs without the long car commutes thatcause smog, noise, traffic congestion, stress, time away from families,and roadway death.<sup id=\"fnref:3\" role=\"doc-noteref\"><a href=\"#fn:3\" class=\"footnote\" rel=\"footnote\">3</a></sup></p><p>So on behalf of myself, my neighborhood, and the community at largeI would like to thank the Strategic Legacy Investment Group and everyoneelse that has been involved in bringing this project and projects like itto Hollywood. Thank you, and we look forward many more.</p><div class=\"footnotes\" role=\"doc-endnotes\">  <ol>    <li id=\"fn:1\" role=\"doc-endnote\">      <p><a href=\"https://www.lahsa.org/dashboards?id=13-greater-los-angeles-homeless-count-by-city-community\">Greater Los Angeles Homeless Count</a> <a href=\"#fnref:1\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>    </li>    <li id=\"fn:2\" role=\"doc-endnote\">      <p>Curbed LA <a href=\"https://la.curbed.com/2017/6/20/15840642/ucla-forecast-affordable-housing-report-home-prices\">article</a> on report from UCLA Anderson School of Management <a href=\"#fnref:2\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>    </li>    <li id=\"fn:3\" role=\"doc-endnote\">      <p><a href=\"https://obamawhitehouse.archives.gov/sites/whitehouse.gov/files/images/Housing_Development_Toolkit%20f.2.pdf\">Housing Development Toolkit</a> <a href=\"#fnref:3\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>    </li>  </ol></div>",
            "url": "http://damienburke.com/dream-groundbreaking",
            
            
            
            
            
            "date_published": "2017-10-16T00:00:00-07:00",
            "date_modified": "2017-10-16T00:00:00-07:00",
            "author": {
                "name": ""
            }
        },
    
        {
            "id": "http://damienburke.com/hsdnc-best-practices",
            "title": "Best Practices of the Hollywood Studio District Neighborhood Council",
            "summary": null,
            "content_text": "What is a Neighborhood Council?Neighborhood councils are a group of representatives who volunteer toserve as advisors to the city of Los Angeles on issues of concern to theneighborhood.Their purpose is “to promote more citizen participation in government andmake government responsible to local needs.”1What is the Hollywood Studio District Neighborhood Council?The Hollywood Studio District Neighborhood Council (HSDNC) is theneighborhood council that represents the Hollywood Studio District of LosAngeles.The Hollywood Studio District is the area south of Hollywood Blvd, east ofEl Centro Ave, North of Melrose, and west of Western Avenue or theHollywood freeway.More information about the HSDNC can be found on theirwebsite.What is this document?This document is my personal opinion on how best to operate the HSDNC,based on my experience as a board member, committee chair, and boardchair, as well as my best understanding of the laws, rules, andregulations governing neighborhood councils and the guidance offered bythe Department of Neighborhood Empowerment (DONE) and other city staff.Some of the things in this document will be specific to the HSDNC, butI anticipate that much of it will useful to other neighborhood councils inLos Angeles and maybe even to other small governmental or otherdeliberative bodies.This is a living document, intended to be updated as things and myunderstanding of them change. If you would like to recommend anyamendments, updates, or corrections please feel free to email me — orbetter yet, open a pull request.What this document is notThis document does not represent the policy, procedures, rules, or opinionof the HSDNC, DONE, the City of Los Angeles, or any other organization.This document is not legal advice. I am not a lawyer. I am not yourlawyer. If you need a lawyer I believe I am required to advise you findone licensed to practice law in your jurisdiction. If your neighborhoodcouncil needs legal advice the city attorney’s office has an entiredivision dedicated to providing that.So you want the HSDNC to…The best way to get the HSDNC to accomplish anything is to present it tothe board as a well-researched and complete action that the board can voteto approve.Ideally, the action would be recommended by a committee but if there is nocommittee with relevant jurisdiction, or there is no time for thecommittee to consider the item you can send it directly to the vice chairand the executive committee will decide whether to include it on the boardagenda.Take a stanceThe HSDNC can take a position on any item whatsoever, with very fewexceptions.The best way to format a statement of the council’s stance is asa resolution. A resolution is a single statement consisting of a series of“whereas” clauses describing the background and reasoning, and one or more“resolved” clauses stating the position.Here is an example resolution:  WHEREAS it is valuable to have the background, reasoning, andexplanation of an action together in one statement; and  WHEREAS the format of resolutions make it easy to include anddistinguish the background, reasoning, and explanation from the decisionof the body; and  WHEREAS the resolution format is standardized and familiar to allgovernment officials; therefore be it  RESOLVED that this writer recommends positions adopted by the HSDNC bewritten as resolutions.Communicate their stance to other parts of city governmentThe HSDNC is an advisory board to they city and as such can communicatetheir positions to other parts of the city government.The best way to communicate the HSDNC’s position to the city council isvia a Community Impact Statement (CIS). The community impact statementprocess was created as a way for neighborhood councils to express theirsupport, opposition, or suggestions about any matter pending before thecity council, city council committees, or city commission.If a community impact statement is submitted in time, the NC’s positionwill be printed on the agenda. The full statement becomes part of thecouncil file.At meetings where the item appears on the agenda, if the NC has fileda CIS, a representative from the board will be given five minutes to speakabout the board stance on the matter. Speakers are usually given one totwo minutes for their comments.The best way to format a CIS is as a resolution like any other positionthe board takes. However, it is very important with a CIS to be specificabout the relevant council file; the board stance (for, against, for ifamended, against if amended, no position, neutral position), and theagency the statement is directed to (the city council, or a citycommission).Here is an example resolution to submit a CIS:  WHEREAS the Congress of Neighborhood is very effective at promotingcitizen participation in government; and  WHEREAS the Department of Neighborhood Empowerment plans to hold theCongress of Neighborhoods in the 4th floor media room, rotunda, Spring St.forecourt, and south lawn in city hall on September 9th, 2017 from 6 am to5 pm; therefore be it  RESOLVED that the Hollywood Studio District Neighborhood Council is forCouncil File 13-0378-S3, authorizing the use of the 4th floor media room,rotunda, Spring St. forecourt, and south lawn in city hall on September9th, 2017 from 6 am to 5 pm.Communicate their stance outside the city governmentThe HSDNC cannot communicate their position to governments or governmentalagencies outside the city. The HSDNC, like all neighborhood councils, ispart of the government of the City of Los Angeles and within the City ofLos Angeles only the Mayor and the City Council have power overintergovernmental relations.Spend money on NC operationsEach neighborhood council is given an annual budget currently amounting to$47,000 per fiscal year. This money can be used for operations, outreach,community improvement projects, and conducting NC elections.Give money to an organization to create a benefit in the communityA portion of the NC’s budget can be used to provide grants to publicschools or 501(c)(3)’s to support a public purpose and benefit thepublic-at-large.If you wish to apply for an Neighborhood Purpose Grant (NPG), theapplication is available on the city clerk’s website.Send the completed application, along with all supporting documentation tothe chair and treasurer. They will bring it to the executive committeewhich will decide whether to put it on the board agenda.How to call meetingWhenRegular meetings should be at the date and time set by the standingmeeting calendar. For the HSDNC board this is every second Monday at 6:30pm.Special meetings can be called when necessary but should be avoided. It isvery difficult to find a date and time that all the  board or committeemembers are available. Also, other stakeholders, who are familiar with thestanding meeting calendar, are less likely to be aware of a specialmeeting.WhereMeetings must be held within the boundaries of the NC.2Meeting locations must be open to the public.3Meeting locations must be ADA compliant.3The HSDNC has twenty board members and routinely sees 20 members of thepublic at board meetings so board meeting locations should accommodate atleast 50 people.Committees are typically much smaller and the meeting are lesswell-attended so their venues can be smaller.Setting the agendaThe board agenda is set by the executive committee.4To help ensure the best possible agenda and make the executive committeemeeting efficient, the chair should prepare a proposed agenda. Theexecutive committee can review each item individually to amend or removeas they wish. Afterwards, the committee can decide to add any agenda itemsthat were not on the chair’s proposed agenda. And finally they can discusschanging the order of agenda items as they see fit.The easiest way to create an agenda is to start with a duplicate of theprevious month’s agenda. Change the date on the first page and in thefooter, remove the items that don’t happen every month, and update thedates for the minutes and MER that need to be approved.The chair should create a proposed agenda for the next meeting as soon asthe current agenda is finalized. This makes it easy to add items as soonas they are brought to the chair’s attention instead of trying to gatherthem all together immediately before the executive committee meeting.It is best to err on the side of including an item on the chair’s proposedagenda even if there are good reasons for it not to be on the boardagenda. It is easy to remove an item from the proposed agenda. It isdifficult to remember to discuss an item that is not on the proposedagenda.Committee agendas are set by the committee chair.Agenda items should contain enough detail to provide sufficient notice toa reasonable person about the action the board is contemplating. If theboard is taking a position or submitting a community impact statement, theentire resolution should be included.Posting the agendaAll HSDNC agendas need to be posted via the city’s Early NotificationSystem (ENS), physically at the Lemon Grove park, and on the HSDNCwebsite.To post the agenda via ENS send the agenda as a PDF to NC support with thedate and title of the meeting in the subject.To post the agenda at Lemon Grove park you can go there yourself, or emailthe recreation coordinator and ask them to post it for you.To post the agenda on the website add an event to the meetings calendaron NationBuilder and upload the agenda to it as a PDF.Agendas should also be sent to the HSDNC mailing list on NationBuilder. Boardagendas should be sent to all supporters. Committee agendas should be sent topeople who are interested in that committee.Paper copiesDuring the board meeting, board members are going to need the agenda, theminutes of the previous meeting, the previous month’s MER, and possiblyother materials. Distributing these items individually is time-consumingand disruptive.Meetings go smoother if every board member is given a packet of thematerials they need before the meeting begins. For ease of use, put theagenda first, and the rest of the materials in the order they will beneeded.            Los Angeles, California, City Charter, art IX, sec. 900. &#8617;              HSDNC Bylaws, art. VIII, section 1, rev. June 1, 2015. &#8617;              Brown Act, California Government code sec. 54961 paragraph a &#8617; &#8617;2              HSDNC Bylaws, art. IIX, section 2, rev. June 1, 2015. &#8617;      ",
            "content_html": "<h1 id=\"what-is-a-neighborhood-council\">What is a Neighborhood Council?</h1><p>Neighborhood councils are a group of representatives who volunteer toserve as advisors to the city of Los Angeles on issues of concern to theneighborhood.</p><p>Their purpose is “to promote more citizen participation in government andmake government responsible to local needs.”<sup id=\"fnref:IX-900\" role=\"doc-noteref\"><a href=\"#fn:IX-900\" class=\"footnote\" rel=\"footnote\">1</a></sup></p><h1 id=\"what-is-the-hollywood-studio-district-neighborhood-council\">What is the Hollywood Studio District Neighborhood Council?</h1><p>The Hollywood Studio District Neighborhood Council (HSDNC) is theneighborhood council that represents the Hollywood Studio District of LosAngeles.</p><p>The Hollywood Studio District is the area south of Hollywood Blvd, east ofEl Centro Ave, North of Melrose, and west of Western Avenue or theHollywood freeway.</p><p>More information about the HSDNC can be found on their<a href=\"https://www.hsdnc.org/\">website</a>.</p><h1 id=\"what-is-this-document\">What is this document?</h1><p>This document is my personal opinion on how best to operate the HSDNC,based on my experience as a board member, committee chair, and boardchair, as well as my best understanding of the laws, rules, andregulations governing neighborhood councils and the guidance offered bythe Department of Neighborhood Empowerment (DONE) and other city staff.</p><p>Some of the things in this document will be specific to the HSDNC, butI anticipate that much of it will useful to other neighborhood councils inLos Angeles and maybe even to other small governmental or otherdeliberative bodies.</p><p>This is a living document, intended to be updated as things and myunderstanding of them change. If you would like to recommend anyamendments, updates, or corrections please feel free to email me — orbetter yet, open a pull request.</p><h1 id=\"what-this-document-is-not\">What this document is not</h1><p>This document does not represent the policy, procedures, rules, or opinionof the HSDNC, DONE, the City of Los Angeles, or any other organization.</p><p>This document is not legal advice. I am not a lawyer. I am not yourlawyer. If you need a lawyer I believe I am required to advise you findone licensed to practice law in your jurisdiction. If your neighborhoodcouncil needs legal advice the city attorney’s office has an entiredivision dedicated to providing that.</p><h1 id=\"so-you-want-the-hsdnc-to\">So you want the HSDNC to…</h1><p>The best way to get the HSDNC to accomplish anything is to present it tothe board as a well-researched and complete action that the board can voteto approve.</p><p>Ideally, the action would be recommended by a committee but if there is nocommittee with relevant jurisdiction, or there is no time for thecommittee to consider the item you can send it directly to the vice chairand the executive committee will decide whether to include it on the boardagenda.</p><h2 id=\"take-a-stance\">Take a stance</h2><p>The HSDNC can take a position on any item whatsoever, with very fewexceptions.</p><p>The best way to format a statement of the council’s stance is asa resolution. A resolution is a single statement consisting of a series of“whereas” clauses describing the background and reasoning, and one or more“resolved” clauses stating the position.</p><p>Here is an example resolution:</p><blockquote>  <p>WHEREAS it is valuable to have the background, reasoning, andexplanation of an action together in one statement; and</p></blockquote><blockquote>  <p>WHEREAS the format of resolutions make it easy to include anddistinguish the background, reasoning, and explanation from the decisionof the body; and</p></blockquote><blockquote>  <p>WHEREAS the resolution format is standardized and familiar to allgovernment officials; therefore be it</p></blockquote><blockquote>  <p>RESOLVED that this writer recommends positions adopted by the HSDNC bewritten as resolutions.</p></blockquote><h2 id=\"communicate-their-stance-to-other-parts-of-city-government\">Communicate their stance to other parts of city government</h2><p>The HSDNC is an advisory board to they city and as such can communicatetheir positions to other parts of the city government.</p><p>The best way to communicate the HSDNC’s position to the city council isvia a Community Impact Statement (CIS). The community impact statementprocess was created as a way for neighborhood councils to express theirsupport, opposition, or suggestions about any matter pending before thecity council, city council committees, or city commission.</p><p>If a community impact statement is submitted in time, the NC’s positionwill be printed on the agenda. The full statement becomes part of thecouncil file.</p><p>At meetings where the item appears on the agenda, if the NC has fileda CIS, a representative from the board will be given five minutes to speakabout the board stance on the matter. Speakers are usually given one totwo minutes for their comments.</p><p>The best way to format a CIS is as a resolution like any other positionthe board takes. However, it is very important with a CIS to be specificabout the relevant council file; the board stance (for, against, for ifamended, against if amended, no position, neutral position), and theagency the statement is directed to (the city council, or a citycommission).</p><p>Here is an example resolution to submit a CIS:</p><blockquote>  <p>WHEREAS the Congress of Neighborhood is very effective at promotingcitizen participation in government; and</p></blockquote><blockquote>  <p>WHEREAS the Department of Neighborhood Empowerment plans to hold theCongress of Neighborhoods in the 4th floor media room, rotunda, Spring St.forecourt, and south lawn in city hall on September 9th, 2017 from 6 am to5 pm; therefore be it</p></blockquote><blockquote>  <p>RESOLVED that the Hollywood Studio District Neighborhood Council is forCouncil File 13-0378-S3, authorizing the use of the 4th floor media room,rotunda, Spring St. forecourt, and south lawn in city hall on September9th, 2017 from 6 am to 5 pm.</p></blockquote><h2 id=\"communicate-their-stance-outside-the-city-government\">Communicate their stance outside the city government</h2><p>The HSDNC cannot communicate their position to governments or governmentalagencies outside the city. The HSDNC, like all neighborhood councils, ispart of the government of the City of Los Angeles and within the City ofLos Angeles only the Mayor and the City Council have power overintergovernmental relations.</p><h2 id=\"spend-money-on-nc-operations\">Spend money on NC operations</h2><p>Each neighborhood council is given an annual budget currently amounting to$47,000 per fiscal year. This money can be used for operations, outreach,community improvement projects, and conducting NC elections.</p><!--- ## Community improvement projects]] ---><h2 id=\"give-money-to-an-organization-to-create-a-benefit-in-the-community\">Give money to an organization to create a benefit in the community</h2><p>A portion of the NC’s budget can be used to provide grants to publicschools or 501(c)(3)’s to support a public purpose and benefit thepublic-at-large.</p><p>If you wish to apply for an Neighborhood Purpose Grant (NPG), theapplication is available on the city clerk’s website.</p><p>Send the completed application, along with all supporting documentation tothe chair and treasurer. They will bring it to the executive committeewhich will decide whether to put it on the board agenda.</p><h1 id=\"how-to-call-meeting\">How to call meeting</h1><h2 id=\"when\">When</h2><p>Regular meetings should be at the date and time set by the standingmeeting calendar. For the HSDNC board this is every second Monday at 6:30pm.</p><p>Special meetings can be called when necessary but should be avoided. It isvery difficult to find a date and time that all the  board or committeemembers are available. Also, other stakeholders, who are familiar with thestanding meeting calendar, are less likely to be aware of a specialmeeting.</p><h2 id=\"where\">Where</h2><p>Meetings must be held within the boundaries of the NC.<sup id=\"fnref:VIII-1\" role=\"doc-noteref\"><a href=\"#fn:VIII-1\" class=\"footnote\" rel=\"footnote\">2</a></sup></p><p>Meeting locations must be open to the public.<sup id=\"fnref:54961-a\" role=\"doc-noteref\"><a href=\"#fn:54961-a\" class=\"footnote\" rel=\"footnote\">3</a></sup></p><p>Meeting locations must be ADA compliant.<sup id=\"fnref:54961-a:1\" role=\"doc-noteref\"><a href=\"#fn:54961-a\" class=\"footnote\" rel=\"footnote\">3</a></sup></p><p>The HSDNC has twenty board members and routinely sees 20 members of thepublic at board meetings so board meeting locations should accommodate atleast 50 people.</p><p>Committees are typically much smaller and the meeting are lesswell-attended so their venues can be smaller.</p><h2 id=\"setting-the-agenda\">Setting the agenda</h2><p>The board agenda is set by the executive committee.<sup id=\"fnref:IIX-2\" role=\"doc-noteref\"><a href=\"#fn:IIX-2\" class=\"footnote\" rel=\"footnote\">4</a></sup></p><p>To help ensure the best possible agenda and make the executive committeemeeting efficient, the chair should prepare a proposed agenda. Theexecutive committee can review each item individually to amend or removeas they wish. Afterwards, the committee can decide to add any agenda itemsthat were not on the chair’s proposed agenda. And finally they can discusschanging the order of agenda items as they see fit.</p><p>The easiest way to create an agenda is to start with a duplicate of theprevious month’s agenda. Change the date on the first page and in thefooter, remove the items that don’t happen every month, and update thedates for the minutes and MER that need to be approved.</p><p>The chair should create a proposed agenda for the next meeting as soon asthe current agenda is finalized. This makes it easy to add items as soonas they are brought to the chair’s attention instead of trying to gatherthem all together immediately before the executive committee meeting.</p><p>It is best to err on the side of including an item on the chair’s proposedagenda even if there are good reasons for it not to be on the boardagenda. It is easy to remove an item from the proposed agenda. It isdifficult to remember to discuss an item that is not on the proposedagenda.</p><p>Committee agendas are set by the committee chair.</p><p>Agenda items should contain enough detail to provide sufficient notice toa reasonable person about the action the board is contemplating. If theboard is taking a position or submitting a community impact statement, theentire resolution should be included.</p><h2 id=\"posting-the-agenda\">Posting the agenda</h2><p>All HSDNC agendas need to be posted via the city’s Early NotificationSystem (ENS), physically at the Lemon Grove park, and on the HSDNCwebsite.</p><p>To post the agenda via ENS send the agenda as a PDF to NC support with thedate and title of the meeting in the subject.</p><p>To post the agenda at Lemon Grove park you can go there yourself, or emailthe recreation coordinator and ask them to post it for you.</p><p>To post the agenda on the website add an event to the meetings calendaron NationBuilder and upload the agenda to it as a PDF.</p><p>Agendas should also be sent to the HSDNC mailing list on NationBuilder. Boardagendas should be sent to all supporters. Committee agendas should be sent topeople who are interested in that committee.</p><h2 id=\"paper-copies\">Paper copies</h2><p>During the board meeting, board members are going to need the agenda, theminutes of the previous meeting, the previous month’s MER, and possiblyother materials. Distributing these items individually is time-consumingand disruptive.</p><p>Meetings go smoother if every board member is given a packet of thematerials they need before the meeting begins. For ease of use, put theagenda first, and the rest of the materials in the order they will beneeded.</p><div class=\"footnotes\" role=\"doc-endnotes\">  <ol>    <li id=\"fn:IX-900\" role=\"doc-endnote\">      <p>Los Angeles, California, City Charter, art IX, sec. 900. <a href=\"#fnref:IX-900\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>    </li>    <li id=\"fn:VIII-1\" role=\"doc-endnote\">      <p>HSDNC Bylaws, art. VIII, section 1, rev. June 1, 2015. <a href=\"#fnref:VIII-1\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>    </li>    <li id=\"fn:54961-a\" role=\"doc-endnote\">      <p>Brown Act, California Government code sec. 54961 paragraph a <a href=\"#fnref:54961-a\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a> <a href=\"#fnref:54961-a:1\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;<sup>2</sup></a></p>    </li>    <li id=\"fn:IIX-2\" role=\"doc-endnote\">      <p>HSDNC Bylaws, art. IIX, section 2, rev. June 1, 2015. <a href=\"#fnref:IIX-2\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>    </li>  </ol></div>",
            "url": "http://damienburke.com/hsdnc-best-practices",
            
            
            
            
            
            "date_published": "2017-06-05T00:00:00-07:00",
            "date_modified": "2017-06-05T00:00:00-07:00",
            "author": {
                "name": ""
            }
        },
    
        {
            "id": "http://damienburke.com/tree-specs-vs-exception-specs",
            "title": "Tree Specs vs. Exception Specs",
            "summary": null,
            "content_text": "After years of fighting, the zombies have been contained and now it’s timeto rebuild civilization. Everyone has a particular job to do in thistechnological reboot and yours is to write a blog platform. It could beworse. Someone is out there inspecting septic tank interiors.Your post-apocalyptic project manager used to be a newspaper editor and assuch he’s a stickler for some journalism best practices. For instance, hewants to make sure that posts cannot be edited after they have beenpublished.So you write this spec:RSpec.describe Post do  describe \"#editable?\" do    context \"when the post is published\" do      subject { Post.new published_at: Time.now.utc }      it { is_expected.not_to be_editable }    end    context \"when the post is not published\" do      subject { Post.new published_at: nil }      it { is_expected.to be_editable }    end  endendBefore the cataclysm, your PM was a bit of a control freak. He almostburst a blood vessel when a writer changed an article that he had alreadyapproved. He wants to make sure that cannot happen in your new blogplatform.So you modify your specs to look like this:RSpec.describe Post do  describe \"#editable?\" do    subject do      Post.new published_at: published_at, editor_approved: editor_approved    end    context \"when the post is published\" do      let(:published_at) { Time.now.utc }      context \"when the editor has approved\" do        let(:editor_approved) { true }        it { is_expected.not_to be_editable }      end      context \"when the editor has not approved\" do        let(:editor_approved) { false }        it { is_expected.not_to be_editable }      end    end    context \"when the post is not published\" do      let(:published_at) { nil }      context \"when the editor has approved\" do        let(:editor_approved) { true }        it { is_expected.not_to be_editable }      end      context \"when the editor has not approved\" do        let(:editor_approved) { false }        it { is_expected.to be_editable }      end    end  endendThe newspaper industry was struggling even before the end of the world aswe knew it and your PM knows how important it is to pinch pennies. Toavoid paying translators more than once for the same article he wants tomake sure that no one changes an article after it has been translated.So you modify your spec again. Now it looks like this:RSpec.describe Post do  describe \"#editable?\" do    subject do      Post.new(        published_at: published_at,        editor_approved: editor_approved,        translated: translated,      )    end    context \"when the post is published\" do      let(:published_at) { Time.now.utc }      context \"when the editor has approved\" do        let(:editor_approved) { true }        context \"when the post has been translated\" do          let(:translated) { true }          it { is_expected.not_to be_editable }        end        context \"when the post has not been translated\" do          let(:translated) { false }          it { is_expected.not_to be_editable }        end      end      context \"when the editor has not approved\" do        let(:editor_approved) { false }        context \"when the post has been translated\" do          let(:translated) { true }          it { is_expected.not_to be_editable }        end        context \"when the post has not been translated\" do          let(:translated) { false }          it { is_expected.not_to be_editable }        end      end    end    context \"when the post is not published\" do      let(:published_at) { nil }      context \"when the editor has approved\" do        let(:editor_approved) { true }        context \"when the post has been translated\" do          let(:translated) { true }          it { is_expected.not_to be_editable }        end        context \"when the post has not been translated\" do          let(:translated) { false }          it { is_expected.not_to be_editable }        end      end      context \"when the editor has not approved\" do        let(:editor_approved) { false }        context \"when the post has been translated\" do          let(:translated) { true }          it { is_expected.not_to be_editable }        end        context \"when the post has not been translated\" do          let(:translated) { false }          it { is_expected.to be_editable }        end      end    end  endendThis is spec is starting to get pretty long and hard to follow. And beingthe sort of engineer who is smart enough to survive a zombie apocalypseyou can see that the spec doubles in size every time a new condition isadded.That’s not tenable. Let’s rewind and see if we can find a better way.Before the translation requirement, the spec looked like this:RSpec.describe Post do  describe \"#editable?\" do    subject do      Post.new published_at: published_at, editor_approved: editor_approved    end    context \"when the post is published\" do      let(:published_at) { Time.now.utc }      context \"when the editor has approved\" do        let(:editor_approved) { true }        it { is_expected.not_to be_editable }      end      context \"when the editor has not approved\" do        let(:editor_approved) { false }        it { is_expected.not_to be_editable }      end    end    context \"when the post is not published\" do      let(:published_at) { nil }      context \"when the editor has approved\" do        let(:editor_approved) { true }        it { is_expected.not_to be_editable }      end      context \"when the editor has not approved\" do        let(:editor_approved) { false }        it { is_expected.to be_editable }      end    end  endendThe specification is structured like a binary tree with an expectation ateach terminal leaf. Every condition we add adds another level to the tree,doubles the number of terminal leaves, and doubles the number ofexpectations.Part of the reason you’ve survived this long is your ability to tellhumans apart from zombies. When you apply the same pattern-matching skillsto this spec you notice one of the expectations is different from all ofthe rest.In one situation the post is editable. All the other specs are exceptionsto that situation. When you re-factor the specs to reflect that they lookmore like this:RSpec.describe Post do  describe \"#editable?\" do    subject do      Post.new published_at: published_at, editor_approved: editor_approved    end    let(:published_at) { nil }    let(:editor_approved) { false }    it { is_expected.to be_editable }    context \"when the post is published\" do      let(:published_at) { Time.now.utc }      it { is_expected.not_to be_editable }    end    context \"when the editor has approved\" do      let(:editor_approved) { true }      it { is_expected.not_to be_editable }    end  endendThe spec is now more concise, easier to read, and easier to modify. Whenyou add the translation requirement it looks like this:RSpec.describe Post do  describe \"#editable?\" do    subject do      Post.new(        published_at: published_at,        editor_approved: editor_approved,        translated: translated,      )    end    let(:published_at) { nil }    let(:editor_approved) { false }    let(:translated) { false }    it { is_expected.to be_editable }    context \"when the post is published\" do      let(:published_at) { Time.now.utc }      it { is_expected.not_to be_editable }    end    context \"when the editor has approved\" do      let(:editor_approved) { true }      it { is_expected.not_to be_editable }    end    context \"when the post has been translated\" do      let(:translated) { true }      it { is_expected.not_to be_editable }    end  endendWhen your objects have one normal case and a series of exceptions it makessense to organize your specs that way. They will be shorter, clearer,easier to understand, and easier to modify; exactly what you will needthem to be in order to thrive in the post-zombie apocalypse world.",
            "content_html": "<!-- Ignore this implementation of the post class. It's only here so we can runthe specs in this file using a magic incantation like this: ```shsed -n '/^```/,/^```/ p' < _drafts/exception-spec-versus-tree-specs.md | sed '/^```/ d' | rspec /dev/stdin``````rubyclass Post  attr_accessor :published_at  attr_accessor :editor_approved  attr_accessor :translated  def initialize(published_at: nil, editor_approved: false, translated: false)    @published_at = published_at    @editor_approved = editor_approved    @translated = translated  end  def editable?    !published_at && !editor_approved && !translated  endend``` --><p>After years of fighting, the zombies have been contained and now it’s timeto rebuild civilization. Everyone has a particular job to do in thistechnological reboot and yours is to write a blog platform. It could beworse. Someone is out there inspecting septic tank interiors.</p><p>Your post-apocalyptic project manager used to be a newspaper editor and assuch he’s a stickler for some journalism best practices. For instance, hewants to make sure that posts cannot be edited after they have beenpublished.</p><p>So you write this spec:</p><div class=\"language-ruby highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code><span class=\"no\">RSpec</span><span class=\"p\">.</span><span class=\"nf\">describe</span> <span class=\"no\">Post</span> <span class=\"k\">do</span>  <span class=\"n\">describe</span> <span class=\"s2\">\"#editable?\"</span> <span class=\"k\">do</span>    <span class=\"n\">context</span> <span class=\"s2\">\"when the post is published\"</span> <span class=\"k\">do</span>      <span class=\"n\">subject</span> <span class=\"p\">{</span> <span class=\"no\">Post</span><span class=\"p\">.</span><span class=\"nf\">new</span> <span class=\"ss\">published_at: </span><span class=\"no\">Time</span><span class=\"p\">.</span><span class=\"nf\">now</span><span class=\"p\">.</span><span class=\"nf\">utc</span> <span class=\"p\">}</span>      <span class=\"n\">it</span> <span class=\"p\">{</span> <span class=\"n\">is_expected</span><span class=\"p\">.</span><span class=\"nf\">not_to</span> <span class=\"n\">be_editable</span> <span class=\"p\">}</span>    <span class=\"k\">end</span>    <span class=\"n\">context</span> <span class=\"s2\">\"when the post is not published\"</span> <span class=\"k\">do</span>      <span class=\"n\">subject</span> <span class=\"p\">{</span> <span class=\"no\">Post</span><span class=\"p\">.</span><span class=\"nf\">new</span> <span class=\"ss\">published_at: </span><span class=\"kp\">nil</span> <span class=\"p\">}</span>      <span class=\"n\">it</span> <span class=\"p\">{</span> <span class=\"n\">is_expected</span><span class=\"p\">.</span><span class=\"nf\">to</span> <span class=\"n\">be_editable</span> <span class=\"p\">}</span>    <span class=\"k\">end</span>  <span class=\"k\">end</span><span class=\"k\">end</span></code></pre></div></div><p>Before the cataclysm, your PM was a bit of a control freak. He almostburst a blood vessel when a writer changed an article that he had alreadyapproved. He wants to make sure that cannot happen in your new blogplatform.</p><p>So you modify your specs to look like this:</p><div class=\"language-ruby highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code><span class=\"no\">RSpec</span><span class=\"p\">.</span><span class=\"nf\">describe</span> <span class=\"no\">Post</span> <span class=\"k\">do</span>  <span class=\"n\">describe</span> <span class=\"s2\">\"#editable?\"</span> <span class=\"k\">do</span>    <span class=\"n\">subject</span> <span class=\"k\">do</span>      <span class=\"no\">Post</span><span class=\"p\">.</span><span class=\"nf\">new</span> <span class=\"ss\">published_at: </span><span class=\"n\">published_at</span><span class=\"p\">,</span> <span class=\"ss\">editor_approved: </span><span class=\"n\">editor_approved</span>    <span class=\"k\">end</span>    <span class=\"n\">context</span> <span class=\"s2\">\"when the post is published\"</span> <span class=\"k\">do</span>      <span class=\"n\">let</span><span class=\"p\">(</span><span class=\"ss\">:published_at</span><span class=\"p\">)</span> <span class=\"p\">{</span> <span class=\"no\">Time</span><span class=\"p\">.</span><span class=\"nf\">now</span><span class=\"p\">.</span><span class=\"nf\">utc</span> <span class=\"p\">}</span>      <span class=\"n\">context</span> <span class=\"s2\">\"when the editor has approved\"</span> <span class=\"k\">do</span>        <span class=\"n\">let</span><span class=\"p\">(</span><span class=\"ss\">:editor_approved</span><span class=\"p\">)</span> <span class=\"p\">{</span> <span class=\"kp\">true</span> <span class=\"p\">}</span>        <span class=\"n\">it</span> <span class=\"p\">{</span> <span class=\"n\">is_expected</span><span class=\"p\">.</span><span class=\"nf\">not_to</span> <span class=\"n\">be_editable</span> <span class=\"p\">}</span>      <span class=\"k\">end</span>      <span class=\"n\">context</span> <span class=\"s2\">\"when the editor has not approved\"</span> <span class=\"k\">do</span>        <span class=\"n\">let</span><span class=\"p\">(</span><span class=\"ss\">:editor_approved</span><span class=\"p\">)</span> <span class=\"p\">{</span> <span class=\"kp\">false</span> <span class=\"p\">}</span>        <span class=\"n\">it</span> <span class=\"p\">{</span> <span class=\"n\">is_expected</span><span class=\"p\">.</span><span class=\"nf\">not_to</span> <span class=\"n\">be_editable</span> <span class=\"p\">}</span>      <span class=\"k\">end</span>    <span class=\"k\">end</span>    <span class=\"n\">context</span> <span class=\"s2\">\"when the post is not published\"</span> <span class=\"k\">do</span>      <span class=\"n\">let</span><span class=\"p\">(</span><span class=\"ss\">:published_at</span><span class=\"p\">)</span> <span class=\"p\">{</span> <span class=\"kp\">nil</span> <span class=\"p\">}</span>      <span class=\"n\">context</span> <span class=\"s2\">\"when the editor has approved\"</span> <span class=\"k\">do</span>        <span class=\"n\">let</span><span class=\"p\">(</span><span class=\"ss\">:editor_approved</span><span class=\"p\">)</span> <span class=\"p\">{</span> <span class=\"kp\">true</span> <span class=\"p\">}</span>        <span class=\"n\">it</span> <span class=\"p\">{</span> <span class=\"n\">is_expected</span><span class=\"p\">.</span><span class=\"nf\">not_to</span> <span class=\"n\">be_editable</span> <span class=\"p\">}</span>      <span class=\"k\">end</span>      <span class=\"n\">context</span> <span class=\"s2\">\"when the editor has not approved\"</span> <span class=\"k\">do</span>        <span class=\"n\">let</span><span class=\"p\">(</span><span class=\"ss\">:editor_approved</span><span class=\"p\">)</span> <span class=\"p\">{</span> <span class=\"kp\">false</span> <span class=\"p\">}</span>        <span class=\"n\">it</span> <span class=\"p\">{</span> <span class=\"n\">is_expected</span><span class=\"p\">.</span><span class=\"nf\">to</span> <span class=\"n\">be_editable</span> <span class=\"p\">}</span>      <span class=\"k\">end</span>    <span class=\"k\">end</span>  <span class=\"k\">end</span><span class=\"k\">end</span></code></pre></div></div><p>The newspaper industry was struggling even before the end of the world aswe knew it and your PM knows how important it is to pinch pennies. Toavoid paying translators more than once for the same article he wants tomake sure that no one changes an article after it has been translated.</p><p>So you modify your spec again. Now it looks like this:</p><div class=\"language-ruby highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code><span class=\"no\">RSpec</span><span class=\"p\">.</span><span class=\"nf\">describe</span> <span class=\"no\">Post</span> <span class=\"k\">do</span>  <span class=\"n\">describe</span> <span class=\"s2\">\"#editable?\"</span> <span class=\"k\">do</span>    <span class=\"n\">subject</span> <span class=\"k\">do</span>      <span class=\"no\">Post</span><span class=\"p\">.</span><span class=\"nf\">new</span><span class=\"p\">(</span>        <span class=\"ss\">published_at: </span><span class=\"n\">published_at</span><span class=\"p\">,</span>        <span class=\"ss\">editor_approved: </span><span class=\"n\">editor_approved</span><span class=\"p\">,</span>        <span class=\"ss\">translated: </span><span class=\"n\">translated</span><span class=\"p\">,</span>      <span class=\"p\">)</span>    <span class=\"k\">end</span>    <span class=\"n\">context</span> <span class=\"s2\">\"when the post is published\"</span> <span class=\"k\">do</span>      <span class=\"n\">let</span><span class=\"p\">(</span><span class=\"ss\">:published_at</span><span class=\"p\">)</span> <span class=\"p\">{</span> <span class=\"no\">Time</span><span class=\"p\">.</span><span class=\"nf\">now</span><span class=\"p\">.</span><span class=\"nf\">utc</span> <span class=\"p\">}</span>      <span class=\"n\">context</span> <span class=\"s2\">\"when the editor has approved\"</span> <span class=\"k\">do</span>        <span class=\"n\">let</span><span class=\"p\">(</span><span class=\"ss\">:editor_approved</span><span class=\"p\">)</span> <span class=\"p\">{</span> <span class=\"kp\">true</span> <span class=\"p\">}</span>        <span class=\"n\">context</span> <span class=\"s2\">\"when the post has been translated\"</span> <span class=\"k\">do</span>          <span class=\"n\">let</span><span class=\"p\">(</span><span class=\"ss\">:translated</span><span class=\"p\">)</span> <span class=\"p\">{</span> <span class=\"kp\">true</span> <span class=\"p\">}</span>          <span class=\"n\">it</span> <span class=\"p\">{</span> <span class=\"n\">is_expected</span><span class=\"p\">.</span><span class=\"nf\">not_to</span> <span class=\"n\">be_editable</span> <span class=\"p\">}</span>        <span class=\"k\">end</span>        <span class=\"n\">context</span> <span class=\"s2\">\"when the post has not been translated\"</span> <span class=\"k\">do</span>          <span class=\"n\">let</span><span class=\"p\">(</span><span class=\"ss\">:translated</span><span class=\"p\">)</span> <span class=\"p\">{</span> <span class=\"kp\">false</span> <span class=\"p\">}</span>          <span class=\"n\">it</span> <span class=\"p\">{</span> <span class=\"n\">is_expected</span><span class=\"p\">.</span><span class=\"nf\">not_to</span> <span class=\"n\">be_editable</span> <span class=\"p\">}</span>        <span class=\"k\">end</span>      <span class=\"k\">end</span>      <span class=\"n\">context</span> <span class=\"s2\">\"when the editor has not approved\"</span> <span class=\"k\">do</span>        <span class=\"n\">let</span><span class=\"p\">(</span><span class=\"ss\">:editor_approved</span><span class=\"p\">)</span> <span class=\"p\">{</span> <span class=\"kp\">false</span> <span class=\"p\">}</span>        <span class=\"n\">context</span> <span class=\"s2\">\"when the post has been translated\"</span> <span class=\"k\">do</span>          <span class=\"n\">let</span><span class=\"p\">(</span><span class=\"ss\">:translated</span><span class=\"p\">)</span> <span class=\"p\">{</span> <span class=\"kp\">true</span> <span class=\"p\">}</span>          <span class=\"n\">it</span> <span class=\"p\">{</span> <span class=\"n\">is_expected</span><span class=\"p\">.</span><span class=\"nf\">not_to</span> <span class=\"n\">be_editable</span> <span class=\"p\">}</span>        <span class=\"k\">end</span>        <span class=\"n\">context</span> <span class=\"s2\">\"when the post has not been translated\"</span> <span class=\"k\">do</span>          <span class=\"n\">let</span><span class=\"p\">(</span><span class=\"ss\">:translated</span><span class=\"p\">)</span> <span class=\"p\">{</span> <span class=\"kp\">false</span> <span class=\"p\">}</span>          <span class=\"n\">it</span> <span class=\"p\">{</span> <span class=\"n\">is_expected</span><span class=\"p\">.</span><span class=\"nf\">not_to</span> <span class=\"n\">be_editable</span> <span class=\"p\">}</span>        <span class=\"k\">end</span>      <span class=\"k\">end</span>    <span class=\"k\">end</span>    <span class=\"n\">context</span> <span class=\"s2\">\"when the post is not published\"</span> <span class=\"k\">do</span>      <span class=\"n\">let</span><span class=\"p\">(</span><span class=\"ss\">:published_at</span><span class=\"p\">)</span> <span class=\"p\">{</span> <span class=\"kp\">nil</span> <span class=\"p\">}</span>      <span class=\"n\">context</span> <span class=\"s2\">\"when the editor has approved\"</span> <span class=\"k\">do</span>        <span class=\"n\">let</span><span class=\"p\">(</span><span class=\"ss\">:editor_approved</span><span class=\"p\">)</span> <span class=\"p\">{</span> <span class=\"kp\">true</span> <span class=\"p\">}</span>        <span class=\"n\">context</span> <span class=\"s2\">\"when the post has been translated\"</span> <span class=\"k\">do</span>          <span class=\"n\">let</span><span class=\"p\">(</span><span class=\"ss\">:translated</span><span class=\"p\">)</span> <span class=\"p\">{</span> <span class=\"kp\">true</span> <span class=\"p\">}</span>          <span class=\"n\">it</span> <span class=\"p\">{</span> <span class=\"n\">is_expected</span><span class=\"p\">.</span><span class=\"nf\">not_to</span> <span class=\"n\">be_editable</span> <span class=\"p\">}</span>        <span class=\"k\">end</span>        <span class=\"n\">context</span> <span class=\"s2\">\"when the post has not been translated\"</span> <span class=\"k\">do</span>          <span class=\"n\">let</span><span class=\"p\">(</span><span class=\"ss\">:translated</span><span class=\"p\">)</span> <span class=\"p\">{</span> <span class=\"kp\">false</span> <span class=\"p\">}</span>          <span class=\"n\">it</span> <span class=\"p\">{</span> <span class=\"n\">is_expected</span><span class=\"p\">.</span><span class=\"nf\">not_to</span> <span class=\"n\">be_editable</span> <span class=\"p\">}</span>        <span class=\"k\">end</span>      <span class=\"k\">end</span>      <span class=\"n\">context</span> <span class=\"s2\">\"when the editor has not approved\"</span> <span class=\"k\">do</span>        <span class=\"n\">let</span><span class=\"p\">(</span><span class=\"ss\">:editor_approved</span><span class=\"p\">)</span> <span class=\"p\">{</span> <span class=\"kp\">false</span> <span class=\"p\">}</span>        <span class=\"n\">context</span> <span class=\"s2\">\"when the post has been translated\"</span> <span class=\"k\">do</span>          <span class=\"n\">let</span><span class=\"p\">(</span><span class=\"ss\">:translated</span><span class=\"p\">)</span> <span class=\"p\">{</span> <span class=\"kp\">true</span> <span class=\"p\">}</span>          <span class=\"n\">it</span> <span class=\"p\">{</span> <span class=\"n\">is_expected</span><span class=\"p\">.</span><span class=\"nf\">not_to</span> <span class=\"n\">be_editable</span> <span class=\"p\">}</span>        <span class=\"k\">end</span>        <span class=\"n\">context</span> <span class=\"s2\">\"when the post has not been translated\"</span> <span class=\"k\">do</span>          <span class=\"n\">let</span><span class=\"p\">(</span><span class=\"ss\">:translated</span><span class=\"p\">)</span> <span class=\"p\">{</span> <span class=\"kp\">false</span> <span class=\"p\">}</span>          <span class=\"n\">it</span> <span class=\"p\">{</span> <span class=\"n\">is_expected</span><span class=\"p\">.</span><span class=\"nf\">to</span> <span class=\"n\">be_editable</span> <span class=\"p\">}</span>        <span class=\"k\">end</span>      <span class=\"k\">end</span>    <span class=\"k\">end</span>  <span class=\"k\">end</span><span class=\"k\">end</span></code></pre></div></div><p>This is spec is starting to get pretty long and hard to follow. And beingthe sort of engineer who is smart enough to survive a zombie apocalypseyou can see that the spec doubles in size every time a new condition isadded.</p><p>That’s not tenable. Let’s rewind and see if we can find a better way.</p><p>Before the translation requirement, the spec looked like this:</p><div class=\"language-ruby highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code><span class=\"no\">RSpec</span><span class=\"p\">.</span><span class=\"nf\">describe</span> <span class=\"no\">Post</span> <span class=\"k\">do</span>  <span class=\"n\">describe</span> <span class=\"s2\">\"#editable?\"</span> <span class=\"k\">do</span>    <span class=\"n\">subject</span> <span class=\"k\">do</span>      <span class=\"no\">Post</span><span class=\"p\">.</span><span class=\"nf\">new</span> <span class=\"ss\">published_at: </span><span class=\"n\">published_at</span><span class=\"p\">,</span> <span class=\"ss\">editor_approved: </span><span class=\"n\">editor_approved</span>    <span class=\"k\">end</span>    <span class=\"n\">context</span> <span class=\"s2\">\"when the post is published\"</span> <span class=\"k\">do</span>      <span class=\"n\">let</span><span class=\"p\">(</span><span class=\"ss\">:published_at</span><span class=\"p\">)</span> <span class=\"p\">{</span> <span class=\"no\">Time</span><span class=\"p\">.</span><span class=\"nf\">now</span><span class=\"p\">.</span><span class=\"nf\">utc</span> <span class=\"p\">}</span>      <span class=\"n\">context</span> <span class=\"s2\">\"when the editor has approved\"</span> <span class=\"k\">do</span>        <span class=\"n\">let</span><span class=\"p\">(</span><span class=\"ss\">:editor_approved</span><span class=\"p\">)</span> <span class=\"p\">{</span> <span class=\"kp\">true</span> <span class=\"p\">}</span>        <span class=\"n\">it</span> <span class=\"p\">{</span> <span class=\"n\">is_expected</span><span class=\"p\">.</span><span class=\"nf\">not_to</span> <span class=\"n\">be_editable</span> <span class=\"p\">}</span>      <span class=\"k\">end</span>      <span class=\"n\">context</span> <span class=\"s2\">\"when the editor has not approved\"</span> <span class=\"k\">do</span>        <span class=\"n\">let</span><span class=\"p\">(</span><span class=\"ss\">:editor_approved</span><span class=\"p\">)</span> <span class=\"p\">{</span> <span class=\"kp\">false</span> <span class=\"p\">}</span>        <span class=\"n\">it</span> <span class=\"p\">{</span> <span class=\"n\">is_expected</span><span class=\"p\">.</span><span class=\"nf\">not_to</span> <span class=\"n\">be_editable</span> <span class=\"p\">}</span>      <span class=\"k\">end</span>    <span class=\"k\">end</span>    <span class=\"n\">context</span> <span class=\"s2\">\"when the post is not published\"</span> <span class=\"k\">do</span>      <span class=\"n\">let</span><span class=\"p\">(</span><span class=\"ss\">:published_at</span><span class=\"p\">)</span> <span class=\"p\">{</span> <span class=\"kp\">nil</span> <span class=\"p\">}</span>      <span class=\"n\">context</span> <span class=\"s2\">\"when the editor has approved\"</span> <span class=\"k\">do</span>        <span class=\"n\">let</span><span class=\"p\">(</span><span class=\"ss\">:editor_approved</span><span class=\"p\">)</span> <span class=\"p\">{</span> <span class=\"kp\">true</span> <span class=\"p\">}</span>        <span class=\"n\">it</span> <span class=\"p\">{</span> <span class=\"n\">is_expected</span><span class=\"p\">.</span><span class=\"nf\">not_to</span> <span class=\"n\">be_editable</span> <span class=\"p\">}</span>      <span class=\"k\">end</span>      <span class=\"n\">context</span> <span class=\"s2\">\"when the editor has not approved\"</span> <span class=\"k\">do</span>        <span class=\"n\">let</span><span class=\"p\">(</span><span class=\"ss\">:editor_approved</span><span class=\"p\">)</span> <span class=\"p\">{</span> <span class=\"kp\">false</span> <span class=\"p\">}</span>        <span class=\"n\">it</span> <span class=\"p\">{</span> <span class=\"n\">is_expected</span><span class=\"p\">.</span><span class=\"nf\">to</span> <span class=\"n\">be_editable</span> <span class=\"p\">}</span>      <span class=\"k\">end</span>    <span class=\"k\">end</span>  <span class=\"k\">end</span><span class=\"k\">end</span></code></pre></div></div><p>The specification is structured like a binary tree with an expectation ateach terminal leaf. Every condition we add adds another level to the tree,doubles the number of terminal leaves, and doubles the number ofexpectations.</p><p>Part of the reason you’ve survived this long is your ability to tellhumans apart from zombies. When you apply the same pattern-matching skillsto this spec you notice one of the expectations is different from all ofthe rest.</p><p>In one situation the post is editable. All the other specs are exceptionsto that situation. When you re-factor the specs to reflect that they lookmore like this:</p><div class=\"language-ruby highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code><span class=\"no\">RSpec</span><span class=\"p\">.</span><span class=\"nf\">describe</span> <span class=\"no\">Post</span> <span class=\"k\">do</span>  <span class=\"n\">describe</span> <span class=\"s2\">\"#editable?\"</span> <span class=\"k\">do</span>    <span class=\"n\">subject</span> <span class=\"k\">do</span>      <span class=\"no\">Post</span><span class=\"p\">.</span><span class=\"nf\">new</span> <span class=\"ss\">published_at: </span><span class=\"n\">published_at</span><span class=\"p\">,</span> <span class=\"ss\">editor_approved: </span><span class=\"n\">editor_approved</span>    <span class=\"k\">end</span>    <span class=\"n\">let</span><span class=\"p\">(</span><span class=\"ss\">:published_at</span><span class=\"p\">)</span> <span class=\"p\">{</span> <span class=\"kp\">nil</span> <span class=\"p\">}</span>    <span class=\"n\">let</span><span class=\"p\">(</span><span class=\"ss\">:editor_approved</span><span class=\"p\">)</span> <span class=\"p\">{</span> <span class=\"kp\">false</span> <span class=\"p\">}</span>    <span class=\"n\">it</span> <span class=\"p\">{</span> <span class=\"n\">is_expected</span><span class=\"p\">.</span><span class=\"nf\">to</span> <span class=\"n\">be_editable</span> <span class=\"p\">}</span>    <span class=\"n\">context</span> <span class=\"s2\">\"when the post is published\"</span> <span class=\"k\">do</span>      <span class=\"n\">let</span><span class=\"p\">(</span><span class=\"ss\">:published_at</span><span class=\"p\">)</span> <span class=\"p\">{</span> <span class=\"no\">Time</span><span class=\"p\">.</span><span class=\"nf\">now</span><span class=\"p\">.</span><span class=\"nf\">utc</span> <span class=\"p\">}</span>      <span class=\"n\">it</span> <span class=\"p\">{</span> <span class=\"n\">is_expected</span><span class=\"p\">.</span><span class=\"nf\">not_to</span> <span class=\"n\">be_editable</span> <span class=\"p\">}</span>    <span class=\"k\">end</span>    <span class=\"n\">context</span> <span class=\"s2\">\"when the editor has approved\"</span> <span class=\"k\">do</span>      <span class=\"n\">let</span><span class=\"p\">(</span><span class=\"ss\">:editor_approved</span><span class=\"p\">)</span> <span class=\"p\">{</span> <span class=\"kp\">true</span> <span class=\"p\">}</span>      <span class=\"n\">it</span> <span class=\"p\">{</span> <span class=\"n\">is_expected</span><span class=\"p\">.</span><span class=\"nf\">not_to</span> <span class=\"n\">be_editable</span> <span class=\"p\">}</span>    <span class=\"k\">end</span>  <span class=\"k\">end</span><span class=\"k\">end</span></code></pre></div></div><p>The spec is now more concise, easier to read, and easier to modify. Whenyou add the translation requirement it looks like this:</p><div class=\"language-ruby highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code><span class=\"no\">RSpec</span><span class=\"p\">.</span><span class=\"nf\">describe</span> <span class=\"no\">Post</span> <span class=\"k\">do</span>  <span class=\"n\">describe</span> <span class=\"s2\">\"#editable?\"</span> <span class=\"k\">do</span>    <span class=\"n\">subject</span> <span class=\"k\">do</span>      <span class=\"no\">Post</span><span class=\"p\">.</span><span class=\"nf\">new</span><span class=\"p\">(</span>        <span class=\"ss\">published_at: </span><span class=\"n\">published_at</span><span class=\"p\">,</span>        <span class=\"ss\">editor_approved: </span><span class=\"n\">editor_approved</span><span class=\"p\">,</span>        <span class=\"ss\">translated: </span><span class=\"n\">translated</span><span class=\"p\">,</span>      <span class=\"p\">)</span>    <span class=\"k\">end</span>    <span class=\"n\">let</span><span class=\"p\">(</span><span class=\"ss\">:published_at</span><span class=\"p\">)</span> <span class=\"p\">{</span> <span class=\"kp\">nil</span> <span class=\"p\">}</span>    <span class=\"n\">let</span><span class=\"p\">(</span><span class=\"ss\">:editor_approved</span><span class=\"p\">)</span> <span class=\"p\">{</span> <span class=\"kp\">false</span> <span class=\"p\">}</span>    <span class=\"n\">let</span><span class=\"p\">(</span><span class=\"ss\">:translated</span><span class=\"p\">)</span> <span class=\"p\">{</span> <span class=\"kp\">false</span> <span class=\"p\">}</span>    <span class=\"n\">it</span> <span class=\"p\">{</span> <span class=\"n\">is_expected</span><span class=\"p\">.</span><span class=\"nf\">to</span> <span class=\"n\">be_editable</span> <span class=\"p\">}</span>    <span class=\"n\">context</span> <span class=\"s2\">\"when the post is published\"</span> <span class=\"k\">do</span>      <span class=\"n\">let</span><span class=\"p\">(</span><span class=\"ss\">:published_at</span><span class=\"p\">)</span> <span class=\"p\">{</span> <span class=\"no\">Time</span><span class=\"p\">.</span><span class=\"nf\">now</span><span class=\"p\">.</span><span class=\"nf\">utc</span> <span class=\"p\">}</span>      <span class=\"n\">it</span> <span class=\"p\">{</span> <span class=\"n\">is_expected</span><span class=\"p\">.</span><span class=\"nf\">not_to</span> <span class=\"n\">be_editable</span> <span class=\"p\">}</span>    <span class=\"k\">end</span>    <span class=\"n\">context</span> <span class=\"s2\">\"when the editor has approved\"</span> <span class=\"k\">do</span>      <span class=\"n\">let</span><span class=\"p\">(</span><span class=\"ss\">:editor_approved</span><span class=\"p\">)</span> <span class=\"p\">{</span> <span class=\"kp\">true</span> <span class=\"p\">}</span>      <span class=\"n\">it</span> <span class=\"p\">{</span> <span class=\"n\">is_expected</span><span class=\"p\">.</span><span class=\"nf\">not_to</span> <span class=\"n\">be_editable</span> <span class=\"p\">}</span>    <span class=\"k\">end</span>    <span class=\"n\">context</span> <span class=\"s2\">\"when the post has been translated\"</span> <span class=\"k\">do</span>      <span class=\"n\">let</span><span class=\"p\">(</span><span class=\"ss\">:translated</span><span class=\"p\">)</span> <span class=\"p\">{</span> <span class=\"kp\">true</span> <span class=\"p\">}</span>      <span class=\"n\">it</span> <span class=\"p\">{</span> <span class=\"n\">is_expected</span><span class=\"p\">.</span><span class=\"nf\">not_to</span> <span class=\"n\">be_editable</span> <span class=\"p\">}</span>    <span class=\"k\">end</span>  <span class=\"k\">end</span><span class=\"k\">end</span></code></pre></div></div><p>When your objects have one normal case and a series of exceptions it makessense to organize your specs that way. They will be shorter, clearer,easier to understand, and easier to modify; exactly what you will needthem to be in order to thrive in the post-zombie apocalypse world.</p>",
            "url": "http://damienburke.com/tree-specs-vs-exception-specs",
            
            
            
            
            
            "date_published": "2017-04-02T00:00:00-07:00",
            "date_modified": "2017-04-02T00:00:00-07:00",
            "author": {
                "name": ""
            }
        },
    
        {
            "id": "http://damienburke.com/safe-auto-commercial",
            "title": "Safe Auto Commercial",
            "summary": null,
            "content_text": "Fun RunI’m the guy running the marathon.I think it’s pretty obvious that I am not someone who would, or should berunning marathons.This was a really fun shoot. They shut down a street downtown and I ran back andforth all morning. The sweat is fake, but the exhaustion is real.",
            "content_html": "<h2 id=\"fun-run\">Fun Run</h2><p>I’m the guy running the marathon.</p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/6xyoKnpKl_8\" frameborder=\"0\" allowfullscreen=\"\"></iframe><p>I think it’s pretty obvious that I am not someone who would, or should berunning marathons.</p><p>This was a really fun shoot. They shut down a street downtown and I ran back andforth all morning. The sweat is fake, but the exhaustion is real.</p>",
            "url": "http://damienburke.com/safe-auto-commercial",
            
            
            
            
            
            "date_published": "2016-08-17T00:00:00-07:00",
            "date_modified": "2016-08-17T00:00:00-07:00",
            "author": {
                "name": ""
            }
        },
    
        {
            "id": "http://damienburke.com/types-of-specifications",
            "title": "Types of Specifications",
            "summary": null,
            "content_text": "What is a specification?Before we can talk about specifications we have to know what they are.Specification is a noun, derived from the verb to specify. To specify is tostate explicitly or in detail. Therefore a specification is the result ofstating explicitly or in detail, or something that states explicitly or indetail.Every software team has their own unique points of view, cultural wisdom, andshared practices regarding specifications but they can be grouped into a fewcategories.No specifications“We don’t have have specifications, that’s too much overhead. That’s fine ifyou’re at NASA or Chase but we’re a lean mean startup that has to add featuresfast.”“What feature are you working on now?”“I’m adding a subscription option that gives users a regular allotment ofcredits.”“That’s a specification.”It is not possible to have no specifications. If you don’t know what a methoddoes how could you possibly know how to write it? If you don’t know what yourapplication is supposed to do, how do you make it do that?Implicit specifications“Yeah, we know what the software is doing, but it’s not like we have any actualspecification document.”“You have implicit specifications.”An implicit specification is any specification that doesn’t exist outside ofsomeone’s head.Implicit specifications have a lot of upsides. They are very easy to create,springing into existence with no little or no effort. They are equally easy tochange, as fluid as thought itself.This flexibility is also the downside of implicit specifications. When thebehavior changes constantly and without warning it is very difficult toeffectively use the software. When the specification changes constantly it’sdifficult to write code that meets the it; you are trying to hit a movingtarget.Large, complicated, or confusing specifications exasperate the problem. Whenimplicit, these specifications change for no other reason than it is notpossible to maintain them completely in working memory.Keeping specifications implicit also makes it easy to overlook problems such asambiguity, incompleteness, or inconsistency.Finally, implicit specifications are impossible to communicate. To express themin language is to make them explicit. If the communication is not captured,for example a water-cooler conversation, then the explicit specification is lostforever and what you have left is multiple implicit specifications.Plain English specification“In order to avoid those type of confusions we write our specs down.”“What spec are you working on implementing now?”“I’ll read it to you, ‘Ensure subscribers each have 100 credits biweekly.’”A plain English specification is a specification written in plain English.[0]One of the curious characteristics of English is that it is ambiguous andimprecise. For example, does this happens twice a week or every two weeks? Dosubscribers get their credit balance set to a total of 100 no matter what theprevious value was or is it incremented 100 more than the previous balance?Legalese specifications“We work very hard to avoid ambiguity in our specs.”“Oh? What spec are you working on now?”“It says, ‘Whereas a user has paid a monthly subscription fee, when the month ormid-month period has ended, and the subscriber has at least – ’””– never mind.”Eliminating ambiguities and ensuring precision in language is the same work alawyer does when writing a contract or other legal document. The outcomes areare also very similar. I call these legalese specifications.Even for experts, writing and reading legalese takes considerable effort. Andafter all their training, experience, expertise, and effort, the existence ofcourts demonstrates that legalese is still not always as precise or unambiguousas needed.Executable specificationsAn executable specification is computer code that specifies how another computerprogram works.Executable specifications are precise and unambiguous by their nature ascomputer code.Executable specifications are very useful to keep for regression testing. Acomputer can test your application in seconds or minutes against a specificationthat a human would spend days or weeks on.RecommendationsYou can’t actually do without specifications. My recommendation is that youwrite them down and that you write them as computer code. Executable software isthe only effective way to describe the behavior of executable software.Write your specifications, in executable software, and then use that software todrive your development.I call it specification-driven development.[0] Everything I say about plain English specifications is most likely trueabout specifications written in any natural language.This essay was originally written for Ministry ofVelocity and was first publishedhereon their blog.",
            "content_html": "<h2 id=\"what-is-a-specification\">What is a specification?</h2><p>Before we can talk about specifications we have to know what they are.</p><p>Specification is a noun, derived from the verb to specify. To specify is tostate explicitly or in detail. Therefore a specification is the result ofstating explicitly or in detail, or something that states explicitly or indetail.</p><p>Every software team has their own unique points of view, cultural wisdom, andshared practices regarding specifications but they can be grouped into a fewcategories.</p><h2 id=\"no-specifications\">No specifications</h2><p>“We don’t have have specifications, that’s too much overhead. That’s fine ifyou’re at NASA or Chase but we’re a lean mean startup that has to add featuresfast.”</p><p>“What feature are you working on now?”</p><p>“I’m adding a subscription option that gives users a regular allotment ofcredits.”</p><p>“That’s a specification.”</p><p>It is not possible to have no specifications. If you don’t know what a methoddoes how could you possibly know how to write it? If you don’t know what yourapplication is supposed to do, how do you make it do that?</p><h2 id=\"implicit-specifications\">Implicit specifications</h2><p>“Yeah, we know what the software is doing, but it’s not like we have any actualspecification document.”</p><p>“You have implicit specifications.”</p><p>An implicit specification is any specification that doesn’t exist outside ofsomeone’s head.</p><p>Implicit specifications have a lot of upsides. They are very easy to create,springing into existence with no little or no effort. They are equally easy tochange, as fluid as thought itself.</p><p>This flexibility is also the downside of implicit specifications. When thebehavior changes constantly and without warning it is very difficult toeffectively use the software. When the specification changes constantly it’sdifficult to write code that meets the it; you are trying to hit a movingtarget.</p><p>Large, complicated, or confusing specifications exasperate the problem. Whenimplicit, these specifications change for no other reason than it is notpossible to maintain them completely in working memory.</p><p>Keeping specifications implicit also makes it easy to overlook problems such asambiguity, incompleteness, or inconsistency.</p><p>Finally, implicit specifications are impossible to communicate. To express themin language is to make them explicit. If the communication is not captured,for example a water-cooler conversation, then the explicit specification is lostforever and what you have left is multiple implicit specifications.</p><h2 id=\"plain-english-specification\">Plain English specification</h2><p>“In order to avoid those type of confusions we write our specs down.”</p><p>“What spec are you working on implementing now?”</p><p>“I’ll read it to you, ‘Ensure subscribers each have 100 credits biweekly.’”</p><p>A plain English specification is a specification written in plain English.[0]</p><p>One of the curious characteristics of English is that it is ambiguous andimprecise. For example, does this happens twice a week or every two weeks? Dosubscribers get their credit balance set to a total of 100 no matter what theprevious value was or is it incremented 100 more than the previous balance?</p><h2 id=\"legalese-specifications\">Legalese specifications</h2><p>“We work very hard to avoid ambiguity in our specs.”</p><p>“Oh? What spec are you working on now?”</p><p>“It says, ‘Whereas a user has paid a monthly subscription fee, when the month ormid-month period has ended, and the subscriber has at least – ’”</p><p>”– never mind.”</p><p>Eliminating ambiguities and ensuring precision in language is the same work alawyer does when writing a contract or other legal document. The outcomes areare also very similar. I call these legalese specifications.</p><p>Even for experts, writing and reading legalese takes considerable effort. Andafter all their training, experience, expertise, and effort, the existence ofcourts demonstrates that legalese is still not always as precise or unambiguousas needed.</p><h2 id=\"executable-specifications\">Executable specifications</h2><p>An executable specification is computer code that specifies how another computerprogram works.</p><p>Executable specifications are precise and unambiguous by their nature ascomputer code.</p><p>Executable specifications are very useful to keep for regression testing. Acomputer can test your application in seconds or minutes against a specificationthat a human would spend days or weeks on.</p><h2 id=\"recommendations\">Recommendations</h2><p>You can’t actually do without specifications. My recommendation is that youwrite them down and that you write them as computer code. Executable software isthe only effective way to describe the behavior of executable software.</p><p>Write your specifications, in executable software, and then use that software todrive your development.</p><p>I call it specification-driven development.</p><hr /><p>[0] Everything I say about plain English specifications is most likely trueabout specifications written in any natural language.</p><p>This essay was originally written for <a href=\"https://www.ministryofvelocity.com/\">Ministry ofVelocity</a> and was first published<a href=\"https://blog.ministryofvelocity.com/types-of-specifications-69b2790dcd2d\">here</a>on their <a href=\"https://blog.ministryofvelocity.com/\">blog</a>.</p>",
            "url": "http://damienburke.com/types-of-specifications",
            
            
            
            
            
            "date_published": "2016-06-29T00:00:00-07:00",
            "date_modified": "2016-06-29T00:00:00-07:00",
            "author": {
                "name": ""
            }
        },
    
        {
            "id": "http://damienburke.com/no-fly-no-buy",
            "title": "No Fly, No Buy",
            "summary": null,
            "content_text": "Senator Collins (Maine) has proposed the “Terrorist Firearms Prevention Act of2016”.  The full text of the act is not available, but there is asummary.In an attempt to prevent terrorists from using guns the bill would make itillegal for anyone on the “No Fly” list to purchase a firearm.Like most Americans, I believe that the rights protected by the Second Amendmentare not absolute and that terrorists should not be allowed to purchase firearmsin the United States. For this reason, I support Sen. Collins’ proposalwith a couple of necessary, common-sense adjustments.First, the process for adding and removing people on the “No Fly” list needs tobe clear, transparent, and completely objective. When we are denying peopletheir fundamental and Constitutionally-guaranteed rights, it is important thatthe process be completely transparent and objective.Secondly, additions to the “No Fly” list should not be done in secret. Before werestrict the fundamental and Constitutionally-guaranteed rights of anyone, theyshould have the opportunity to examine the evidence against them and mount adefense.Thirdly, no one should be added to the “No Fly” list for anything less than aviolation of the law. It is fundamentally incompatible with the rule of law todeny people their rights on the basis of suspicion or association. No one shouldbe added to the “No Fly” list without first being convicted of a crime.Finally, persons who have been convicted of a crime and added to the “No Fly”list should be removed from those lists when they have finished their sentenceand are released back into the public. If the criminal justice system hasdetermined that this person is no longer a threat to the public then there isno need to continue to restrict their rights.Sen. Collins’ proposal has none of these safeguards which makes it not onlyincompatible with the Constitution, but, worse, an assault on due process, ruleof law, and the fundamental rights of people who have never been convicted oreven charged with a crime.",
            "content_html": "<p>Senator Collins (Maine) has proposed the “Terrorist Firearms Prevention Act of2016”.  The full text of the act is not available, but there is a<a href=\"https://www.collins.senate.gov/sites/default/files/Terrorist%20Firearms%20Prevention%20Act%20of%202016.pdf\">summary</a>.In an attempt to prevent terrorists from using guns the bill would make itillegal for anyone on the “No Fly” list to purchase a firearm.</p><p>Like most Americans, I believe that the rights protected by the Second Amendmentare not absolute and that terrorists should not be allowed to purchase firearmsin the United States. For this reason, I support Sen. Collins’ proposalwith a couple of necessary, common-sense adjustments.</p><p>First, the process for adding and removing people on the “No Fly” list needs tobe clear, transparent, and completely objective. When we are denying peopletheir fundamental and Constitutionally-guaranteed rights, it is important thatthe process be completely transparent and objective.</p><p>Secondly, additions to the “No Fly” list should not be done in secret. Before werestrict the fundamental and Constitutionally-guaranteed rights of anyone, theyshould have the opportunity to examine the evidence against them and mount adefense.</p><p>Thirdly, no one should be added to the “No Fly” list for anything less than aviolation of the law. It is fundamentally incompatible with the rule of law todeny people their rights on the basis of suspicion or association. No one shouldbe added to the “No Fly” list without first being convicted of a crime.</p><p>Finally, persons who have been convicted of a crime and added to the “No Fly”list should be removed from those lists when they have finished their sentenceand are released back into the public. If the criminal justice system hasdetermined that this person is no longer a threat to the public then there isno need to continue to restrict their rights.</p><p>Sen. Collins’ proposal has none of these safeguards which makes it not onlyincompatible with the Constitution, but, worse, an assault on due process, ruleof law, and the fundamental rights of people who have never been convicted oreven charged with a crime.</p>",
            "url": "http://damienburke.com/no-fly-no-buy",
            
            
            
            "tags": ["no-fly","guns","terrorists"],
            
            "date_published": "2016-06-27T00:00:00-07:00",
            "date_modified": "2016-06-27T00:00:00-07:00",
            "author": {
                "name": ""
            }
        },
    
        {
            "id": "http://damienburke.com/specifications-not-tests",
            "title": "Specifications not Test",
            "summary": null,
            "content_text": "Stop writing tests. I want you to stop writing tests for your code. Stop writingtests and start writing specifications.JudgementTests render judgement. You can fail a test. And if you fail a test what doesthat make you? A failure.Specifications do not render judgement. You can confirm to a specification oryou can not confirm to a specification. That is a choice you get to make. If youare writing an email server, you will probably want to confirm the IMAPspecification. If you are writing a first-person shooter you probably won’t.ChronologyTests come after the fact. You learn fractions, and then you take a test. Youbuild a car, and then you crash-test it.Specifications come first. Before you build anything you need to first identifywhat you are building.OptionalityTests are optional. You can test the waters, or you can just dive in. You cantake a blood test, or you can assume you’re fine.Specifications are not optional. If you don’t specify what it does, how do youknow you are done writing it?NamingYou may already be writing specifications but calling them tests. Call themspecifications. Names are important. If you don’t believe that, rename all ofyour variables and methods by drawing letters from a bag of Scrabble tiles.Random names are still far better than names that are misleading.  Calling aspecification a test is like calling a saddle a seat. The distinction is subtlebut very important. If you treat a saddle like a seat after a few miles yourbutt is going to hurt.If it comes before the application code, is necessary, and isn’t used to judgedevelopers then you are not writing tests, you are writing specifications. Callthem that. If your specifications are used to drive the application development,then you are doing specification-driven development. Call it that.The idea for this essay originated in a Twitterconversation withDave Brady. It was further expanded for a lightingtalk I gave at &amp;:conf.This essay was originally written for Ministry ofVelocity and was first publishedhereon their blog.",
            "content_html": "<p>Stop writing tests. I want you to stop writing tests for your code. Stop writingtests and start writing specifications.</p><h2 id=\"judgement\">Judgement</h2><p>Tests render judgement. You can fail a test. And if you fail a test what doesthat make you? A failure.</p><p>Specifications do not render judgement. You can confirm to a specification oryou can not confirm to a specification. That is a choice you get to make. If youare writing an email server, you will probably want to confirm the IMAPspecification. If you are writing a first-person shooter you probably won’t.</p><h2 id=\"chronology\">Chronology</h2><p>Tests come after the fact. You learn fractions, and then you take a test. Youbuild a car, and then you crash-test it.</p><p>Specifications come first. Before you build anything you need to first identifywhat you are building.</p><h2 id=\"optionality\">Optionality</h2><p>Tests are optional. You can test the waters, or you can just dive in. You cantake a blood test, or you can assume you’re fine.</p><p>Specifications are not optional. If you don’t specify what it does, how do youknow you are done writing it?</p><h2 id=\"naming\">Naming</h2><p>You may already be writing specifications but calling them tests. Call themspecifications. Names are important. If you don’t believe that, rename all ofyour variables and methods by drawing letters from a bag of Scrabble tiles.</p><p>Random names are still far better than names that are misleading.  Calling aspecification a test is like calling a saddle a seat. The distinction is subtlebut very important. If you treat a saddle like a seat after a few miles yourbutt is going to hurt.</p><p>If it comes before the application code, is necessary, and isn’t used to judgedevelopers then you are not writing tests, you are writing specifications. Callthem that. If your specifications are used to drive the application development,then you are doing specification-driven development. Call it that.</p><hr /><p>The idea for this essay originated in a Twitter<a href=\"https://twitter.com/ExMember/status/471745713764712450\">conversation</a> with<a href=\"https://twitter.com/dbrady\">Dave Brady</a>. It was further expanded for a lightingtalk I gave at <a href=\"https://www.andconf.io/\">&amp;:conf</a>.</p><p>This essay was originally written for <a href=\"https://www.ministryofvelocity.com/\">Ministry ofVelocity</a> and was first published<a href=\"https://blog.ministryofvelocity.com/specifications-not-tests-20a74a35b2ee\">here</a>on their <a href=\"https://blog.ministryofvelocity.com/\">blog</a>.</p>",
            "url": "http://damienburke.com/specifications-not-tests",
            
            
            
            
            
            "date_published": "2015-11-21T00:00:00-08:00",
            "date_modified": "2015-11-21T00:00:00-08:00",
            "author": {
                "name": ""
            }
        },
    
        {
            "id": "http://damienburke.com/live-at-the-bike-2015-april-30-ace-ten",
            "title": "Ace-Ten Suited on Live at the Bike",
            "summary": null,
            "content_text": "BackgroundI’m in a no-limit hold’em cash game with $5/$5 blinds and an allowed buy-in of$300 to $1000 dollars.The game is broadcast by Live at the Bike, so if you have access to theirarchives and can actually watch this hand play out. It’s from the April 30, 2015show and starts thirty-two minutes in.The actionMoni opens to $20 from two off the button. I call from one off the button withAdTd. Sean is on the button and over-calls. Both blinds fold.There is $65 in the pot.Moni has a stack of $500, I have a little over $1000, and Sean has us bothcovered.The flop is AsJd8d.Moni checks. I bet $50. Sean calls. Moni raises to $250. I make it $450.  Seanfolds. Moni goes all in for $500 and I call.What the check-raise tells usMoni’s check-raise reveals a lot of information about his hand and as such isthe biggest turning point for me.First, Moni is very unlikely to fold now. The worst odds he could get is if oneof us raises $250 or more and the other folds. He would then have the choice ofcalling $250 to win $1114 or folding.In that scenario Moni has to win less than 22% of the time at showdown to makethe call incorrect. That’s possible if the check-raise is a bluff with no backupequity, but it’s simply not plausible that Moni is check-raising $200, as abluff, into two players who have already shown strength on a wet, ace-high flop.From here we can narrow Moni’s hand range to sets, two-pair, and big combodraws.The only possible combo draw is KdQd. It has 12 outs to a nut or second-nuthand. When called it has a huge amount of equity unless it is up against the nutflush draw. Sean and I have ranges that are wide enough that Moni would winoutright most of the time, and not be up against the nut flush draw much of therest of the time.There is a good chance Moni doesn’t make this play with a combo draw.The two pair hands are AJ, A8, and J8. It questionable whether Moni wouldcheck-raise with J8, but it’s very unlikely he would raise with it pre-flop sowe can take that out of his range.Moni’s complete range is thus almost exactly AcAh, JJ (3 permutation), 88(3 permutations), AJ (4 permutations), A8 (4 permutations), KdQd.What to do about the check-raiseAll-in equity against MoniGetting all-in against Moni would mean putting in $450 more into a pot thatwould end up being $1114, so I only need 40% equity to make that playprofitable.There are 16 possible hands Moni can hold. Against 11 of them I have 9 outs,against one of them I have 12 outs, and the last one I have crushed. Againstthis range I have 43% equity.If my range for Moni is too loose and he can’t have KdQd here I still have 41%equity.In the unlikely event that I also  know Moni also can’t have A8 pre-flop myequity drops to 35%.If my range is too tight and Moni could have AK my equity goes up to 44%.  Ifhe can have AQ also my equity goes up slightly more.And then there is always the non-zero possibility that Moni has some sort oftemporary insanity and has gotten here with a naked flush draw or some othernonsense. Spew happens.For the $450 I would put in, my equity in the pot would probably be $479. Itcould be as low as $390 if Moni is a lot tighter than I expect. It could be alot higher depending on Moni’s spew factor, but I’m confident that raising herehas an EV of about $29.The Sean complicationI’ve gone a long way without mentioning the guy to my left with the big stack,but the fact is that at this point Sean’s hand doesn’t matter.If it were a very strong hand he would have raised on the flop. By just callinghe almost guarantees that we are going to see a turn card and any diamond orBroadway turn will either cause him to be beat or kill his action.On the off chance that he did take that huge risk on the wet flop to get theother big stack to put more money in, I still have at least nine outs to beathim.The only way I could imagine Sean putting more money in this pot is if he had adraw that he wanted to play cheap but now he thinks can use to semi-bluff. Thatcould happen with KdQd, but not only is that exact hand a tiny part of hisrange but it’s very unlikely he’ll play it that way.The call optionGiven that we are behind most of Moni’s range, calling seems like a something toconsider. If for $200 I can get two free cards and then get paid off another$250 if I hit calling is obviously a better option. But this is a pipe dream.Is $200 worth it for one card?Moni can’t have a diamond, so we have nine clean outs among 45 unknown cards anda 20% chance of making a flush on the turn. There is only $604 in the pot whenwe call, so we need to get other players to put in $396 to make this playbreak-even.Moni only has $250 left, and could fold if a diamond comes. Sean is almostcertainly going to fold before the turn. Calling not going to work out.The fold optionWe’ve already established that getting it all in at this point has positiveequity, so it’s a better option than folding. Folding has lower variance, but Iam confident that six big blinds of equity is far too much to give up for that.The re-raise amountMoni only has $250, but Sean has me covered so I can raise to any amount from$450 to all-in which is about $1000.I need the raise to be big enough that Moni won’t call and then save the rest ofhis stack if the diamond hits. The minimum raise is enough for that.I also need the raise to be big enough that Sean doesn’t have the correct oddsto draw to a hand that beats me. The minimum raise is enough for that also.Finally, I mentioned earlier that Sean might have a draw that he could beconvinced has some sort of semi-bluff equity. This is very unlikely, but I wantto leave as much behind as possible in my stack to increase the odds. If Seantries to semi-bluff that would have a lot of value to me.All of these reasons indicate that a minimum raise to $450 is the best possibleamount.Earlier optionsGetting it all in when I’m behind is not usually my plan when I start a hand(although it is an effective way to avoid bad beats). Could I have avoided thissituation? Is there a more profitable way to play this hand?Check the flopChecking the flop could get us to the turn for free. This is a good thing if I’mbehind, or if a free turn could get me paid off more, but both of those thingsare unlikely at that point.Checking the flop could give me a chance to check-raise Sean which would make mysemi-bluff more credible. However, it’s unlikely Sean would bet, and if he didhe would likely call a check-raise with exactly the hands that beat me and foldall the rest.Re-raise pre-flopA pre-flop re-raise has the advantage of making it more likely I get to act lastlater in the hand and making more likely I get heads up against Moni whilerepresenting a stronger range.However this makes our stack-to-pot ratio smaller, which lessens the skill andpositional advantage I have against Moni.Also, Moni is a tight opener, even from this position. A good chunk of his rangeis QQ+ which he is three-betting with. That means I wouldn’t get to see a flopa lot of times, often when he has the hands that are most profitable for me toplay against.Fold pre-flopThis is a reasonable choice because I’m well behind Moni’s opening range.However most of the time Moni is not going to want to continue with the hand.Either he will fail to make a pair or an over-card will come to his pocket pair.In nearly all those cases I will be able to steal the pot easily.If he does like the flop and has me beat I will almost always be able to getaway from the hand cheaply, usually without losing another dollar. But the flopswhere I am likely to have him beat, I will be able to take his stack.ConclusionsMoni turned over AhJs. The turn was 3s. The river was 5c. And I lost $500in under three minutes.This bothered me for a bit because I started the hand crushed by Moni’s rangeand then put in a whole lot of money while still way behind. But after thisanalysis, I am confident I played the hand well. Sometimes even I lose anall-in.",
            "content_html": "<h1 id=\"background\">Background</h1><p>I’m in a no-limit hold’em cash game with $5/$5 blinds and an allowed buy-in of$300 to $1000 dollars.</p><p>The game is broadcast by Live at the Bike, so if you have access to theirarchives and can actually watch this hand play out. It’s from the April 30, 2015show and starts thirty-two minutes in.</p><h1 id=\"the-action\">The action</h1><p>Moni opens to $20 from two off the button. I call from one off the button with<code class=\"language-plaintext highlighter-rouge\">AdTd</code>. Sean is on the button and over-calls. Both blinds fold.</p><p>There is $65 in the pot.</p><p>Moni has a stack of $500, I have a little over $1000, and Sean has us bothcovered.</p><p>The flop is <code class=\"language-plaintext highlighter-rouge\">AsJd8d</code>.</p><p>Moni checks. I bet $50. Sean calls. Moni raises to $250. I make it $450.  Seanfolds. Moni goes all in for $500 and I call.</p><h1 id=\"what-the-check-raise-tells-us\">What the check-raise tells us</h1><p>Moni’s check-raise reveals a lot of information about his hand and as such isthe biggest turning point for me.</p><p>First, Moni is very unlikely to fold now. The worst odds he could get is if oneof us raises $250 or more and the other folds. He would then have the choice ofcalling $250 to win $1114 or folding.</p><p>In that scenario Moni has to win less than 22% of the time at showdown to makethe call incorrect. That’s possible if the check-raise is a bluff with no backupequity, but it’s simply not plausible that Moni is check-raising $200, as abluff, into two players who have already shown strength on a wet, ace-high flop.</p><p>From here we can narrow Moni’s hand range to sets, two-pair, and big combodraws.</p><p>The only possible combo draw is <code class=\"language-plaintext highlighter-rouge\">KdQd</code>. It has 12 outs to a nut or second-nuthand. When called it has a huge amount of equity unless it is up against the nutflush draw. Sean and I have ranges that are wide enough that Moni would winoutright most of the time, and not be up against the nut flush draw much of therest of the time.</p><p>There is a good chance Moni doesn’t make this play with a combo draw.</p><p>The two pair hands are <code class=\"language-plaintext highlighter-rouge\">AJ</code>, <code class=\"language-plaintext highlighter-rouge\">A8</code>, and <code class=\"language-plaintext highlighter-rouge\">J8</code>. It questionable whether Moni wouldcheck-raise with J8, but it’s very unlikely he would raise with it pre-flop sowe can take that out of his range.</p><p>Moni’s complete range is thus almost exactly <code class=\"language-plaintext highlighter-rouge\">AcAh</code>, <code class=\"language-plaintext highlighter-rouge\">JJ</code> (3 permutation), <code class=\"language-plaintext highlighter-rouge\">88</code>(3 permutations), <code class=\"language-plaintext highlighter-rouge\">AJ</code> (4 permutations), <code class=\"language-plaintext highlighter-rouge\">A8</code> (4 permutations), <code class=\"language-plaintext highlighter-rouge\">KdQd</code>.</p><h1 id=\"what-to-do-about-the-check-raise\">What to do about the check-raise</h1><h2 id=\"all-in-equity-against-moni\">All-in equity against Moni</h2><p>Getting all-in against Moni would mean putting in $450 more into a pot thatwould end up being $1114, so I only need 40% equity to make that playprofitable.</p><p>There are 16 possible hands Moni can hold. Against 11 of them I have 9 outs,against one of them I have 12 outs, and the last one I have crushed. Againstthis range I have 43% equity.</p><p>If my range for Moni is too loose and he can’t have <code class=\"language-plaintext highlighter-rouge\">KdQd</code> here I still have 41%equity.</p><p>In the unlikely event that I also  know Moni also can’t have <code class=\"language-plaintext highlighter-rouge\">A8</code> pre-flop myequity drops to 35%.</p><p>If my range is too tight and Moni could have <code class=\"language-plaintext highlighter-rouge\">AK</code> my equity goes up to 44%.  Ifhe can have <code class=\"language-plaintext highlighter-rouge\">AQ</code> also my equity goes up slightly more.</p><p>And then there is always the non-zero possibility that Moni has some sort oftemporary insanity and has gotten here with a naked flush draw or some othernonsense. Spew happens.</p><p>For the $450 I would put in, my equity in the pot would probably be $479. Itcould be as low as $390 if Moni is a lot tighter than I expect. It could be alot higher depending on Moni’s spew factor, but I’m confident that raising herehas an EV of about $29.</p><h2 id=\"the-sean-complication\">The Sean complication</h2><p>I’ve gone a long way without mentioning the guy to my left with the big stack,but the fact is that at this point Sean’s hand doesn’t matter.</p><p>If it were a very strong hand he would have raised on the flop. By just callinghe almost guarantees that we are going to see a turn card and any diamond orBroadway turn will either cause him to be beat or kill his action.</p><p>On the off chance that he did take that huge risk on the wet flop to get theother big stack to put more money in, I still have at least nine outs to beathim.</p><p>The only way I could imagine Sean putting more money in this pot is if he had adraw that he wanted to play cheap but now he thinks can use to semi-bluff. Thatcould happen with <code class=\"language-plaintext highlighter-rouge\">KdQd</code>, but not only is that exact hand a tiny part of hisrange but it’s very unlikely he’ll play it that way.</p><h2 id=\"the-call-option\">The call option</h2><p>Given that we are behind most of Moni’s range, calling seems like a something toconsider. If for $200 I can get two free cards and then get paid off another$250 if I hit calling is obviously a better option. But this is a pipe dream.</p><p>Is $200 worth it for one card?</p><p>Moni can’t have a diamond, so we have nine clean outs among 45 unknown cards anda 20% chance of making a flush on the turn. There is only $604 in the pot whenwe call, so we need to get other players to put in $396 to make this playbreak-even.</p><p>Moni only has $250 left, and could fold if a diamond comes. Sean is almostcertainly going to fold before the turn. Calling not going to work out.</p><h2 id=\"the-fold-option\">The fold option</h2><p>We’ve already established that getting it all in at this point has positiveequity, so it’s a better option than folding. Folding has lower variance, but Iam confident that six big blinds of equity is far too much to give up for that.</p><h2 id=\"the-re-raise-amount\">The re-raise amount</h2><p>Moni only has $250, but Sean has me covered so I can raise to any amount from$450 to all-in which is about $1000.</p><p>I need the raise to be big enough that Moni won’t call and then save the rest ofhis stack if the diamond hits. The minimum raise is enough for that.</p><p>I also need the raise to be big enough that Sean doesn’t have the correct oddsto draw to a hand that beats me. The minimum raise is enough for that also.</p><p>Finally, I mentioned earlier that Sean might have a draw that he could beconvinced has some sort of semi-bluff equity. This is very unlikely, but I wantto leave as much behind as possible in my stack to increase the odds. If Seantries to semi-bluff that would have a lot of value to me.</p><p>All of these reasons indicate that a minimum raise to $450 is the best possibleamount.</p><h1 id=\"earlier-options\">Earlier options</h1><p>Getting it all in when I’m behind is not usually my plan when I start a hand(although it is an effective way to avoid bad beats). Could I have avoided thissituation? Is there a more profitable way to play this hand?</p><h2 id=\"check-the-flop\">Check the flop</h2><p>Checking the flop could get us to the turn for free. This is a good thing if I’mbehind, or if a free turn could get me paid off more, but both of those thingsare unlikely at that point.</p><p>Checking the flop could give me a chance to check-raise Sean which would make mysemi-bluff more credible. However, it’s unlikely Sean would bet, and if he didhe would likely call a check-raise with exactly the hands that beat me and foldall the rest.</p><h2 id=\"re-raise-pre-flop\">Re-raise pre-flop</h2><p>A pre-flop re-raise has the advantage of making it more likely I get to act lastlater in the hand and making more likely I get heads up against Moni whilerepresenting a stronger range.</p><p>However this makes our stack-to-pot ratio smaller, which lessens the skill andpositional advantage I have against Moni.</p><p>Also, Moni is a tight opener, even from this position. A good chunk of his rangeis <code class=\"language-plaintext highlighter-rouge\">QQ+</code> which he is three-betting with. That means I wouldn’t get to see a flopa lot of times, often when he has the hands that are most profitable for me toplay against.</p><h2 id=\"fold-pre-flop\">Fold pre-flop</h2><p>This is a reasonable choice because I’m well behind Moni’s opening range.</p><p>However most of the time Moni is not going to want to continue with the hand.Either he will fail to make a pair or an over-card will come to his pocket pair.In nearly all those cases I will be able to steal the pot easily.</p><p>If he does like the flop and has me beat I will almost always be able to getaway from the hand cheaply, usually without losing another dollar. But the flopswhere I am likely to have him beat, I will be able to take his stack.</p><h1 id=\"conclusions\">Conclusions</h1><p>Moni turned over <code class=\"language-plaintext highlighter-rouge\">AhJs</code>. The turn was <code class=\"language-plaintext highlighter-rouge\">3s</code>. The river was <code class=\"language-plaintext highlighter-rouge\">5c</code>. And I lost $500in under three minutes.</p><p>This bothered me for a bit because I started the hand crushed by Moni’s rangeand then put in a whole lot of money while still way behind. But after thisanalysis, I am confident I played the hand well. Sometimes even I lose anall-in.</p>",
            "url": "http://damienburke.com/live-at-the-bike-2015-april-30-ace-ten",
            
            
            
            "tags": ["hand analysis","Live at the Bike"],
            
            "date_published": "2015-05-18T00:00:00-07:00",
            "date_modified": "2015-05-18T00:00:00-07:00",
            "author": {
                "name": ""
            }
        },
    
        {
            "id": "http://damienburke.com/petrified-forest-reviews",
            "title": "Petrified Forest Reviews",
            "summary": null,
            "content_text": "For once I didn’t read the reviews of a show I was in, but that also means Ididn’t share them – until now.  The story takes on a dark tone when a quartet of gun toting gangster thugs turnup, holding the others captive. They are played by a tough George Tovar (in theBogart role), an animated David Mingrino, Damien Burke, and Roger Payano.– Tolucan Times  … high-stakes drama that is surprisingly still relevant and as wildlyentertaining today as it must have been in 1935 when it was written… top-notchtheatrical entertainment.– Life in LA  The Petrified Forest endures because it has it all: romance, suspense, danger,sex and even a little politics. A fantasy of the highway, it unfurls like adream of a still-untamed corner of the American West.– BroadwayWorld  The story has an incredible denouement, with all actors, an amazing ensembleof 18, each one gifted in his\\her own right, and at a level always expected fromthe productions at Theatre West. This cast has done a great service to theplaywright’s brilliant, and at times, intense story.– Examiner",
            "content_html": "<p>For once I didn’t read the reviews of a show I was in, but that also means Ididn’t share them – until now.</p><blockquote>  <p>The story takes on a dark tone when a quartet of gun toting gangster thugs turnup, holding the others captive. They are played by a tough George Tovar (in theBogart role), an animated David Mingrino, Damien Burke, and Roger Payano.</p></blockquote><p>– Tolucan Times</p><blockquote>  <p>… high-stakes drama that is surprisingly still relevant and as wildlyentertaining today as it must have been in 1935 when it was written… top-notchtheatrical entertainment.</p></blockquote><p>– Life in LA</p><blockquote>  <p>The Petrified Forest endures because it has it all: romance, suspense, danger,sex and even a little politics. A fantasy of the highway, it unfurls like adream of a still-untamed corner of the American West.</p></blockquote><p>– <a href=\"https://www.broadwayworld.com/los-angeles/article/BWW-Reviews-THE-PETRIFIED-FOREST-is-a-Clever-Mash-Up-of-a-Love-Story-Gangster-Tale-and-Political-Drama-20140324\">BroadwayWorld</a></p><blockquote>  <p>The story has an incredible denouement, with all actors, an amazing ensembleof 18, each one gifted in his\\her own right, and at a level always expected fromthe productions at Theatre West. This cast has done a great service to theplaywright’s brilliant, and at times, intense story.</p></blockquote><p>– Examiner</p>",
            "url": "http://damienburke.com/petrified-forest-reviews",
            
            
            
            
            
            "date_published": "2014-10-13T03:38:29-07:00",
            "date_modified": "2014-10-13T03:38:29-07:00",
            "author": {
                "name": ""
            }
        },
    
        {
            "id": "http://damienburke.com/only-a-few-more-days-to-catch-the-olivia-experiment",
            "title": "Only a few more days to catch \"The Olivia Experiment\" ",
            "summary": null,
            "content_text": "Did you see “The Olivia Experiment” at Laemmle’s Music Hall 3 in Beverly Hills?Why not? Didn’t you read the review in the LATimes?They called it “refreshingly original” and “Porlandia meets Judy Blume.”Did you show up to Friday’s screening and see this? There isn’t much time left, “The Olivia Experiment” closes August 28th. Ticketsare available now.Go see it. (I’m in it!)",
            "content_html": "<p>Did you see “The Olivia Experiment” at Laemmle’s Music Hall 3 in Beverly Hills?</p><p>Why not? Didn’t you read the review in the <a href=\"https://www.latimes.com/entertainment/movies/la-et-mn-olivia-experiment-movie-review-20140822-story.html\">LATimes</a>?They called it “refreshingly original” and “Porlandia meets Judy Blume.”</p><p>Did you show up to Friday’s screening and see this? <img src=\"/images/olivia-sold-out.jpg\" alt=\"The Olivia Experiment 7:20SoldOut!\" /></p><p>There isn’t much time left, “The Olivia Experiment” closes August 28th. <a href=\"https://laemmle.com/films/38411\">Ticketsare available now</a>.</p><p>Go see it. (I’m in it!)</p>",
            "url": "http://damienburke.com/only-a-few-more-days-to-catch-the-olivia-experiment",
            "image": "/images/olivia-sold-out.jpg",
            
            
            
            
            "date_published": "2014-08-25T17:18:15-07:00",
            "date_modified": "2014-08-25T17:18:15-07:00",
            "author": {
                "name": ""
            }
        },
    
        {
            "id": "http://damienburke.com/the-olivia-experiment-opens-aug-22",
            "title": "The Olivia Experiment opens Aug 22",
            "summary": null,
            "content_text": "“The Olivia Experiment” opens Friday August 22nd at the Laemmle Music Hall foran exclusive one-week engagement.After the 7:20 showing opening night there will be a Q&amp;A with lead actress SkyeNoel, screenwriter Alexandra Kominsaruk, director Sonja Schenk, andcinematographer William MacCollum.Saturday the 23rd will feature free CDs with music from the band Small Sails whoare featured on “The Olivia Experiment” soundtrack.I know I said it was going to open last week, I was wrong. I know, I amsurprised as you.But I’m not wrong when I say I’m in this movie and it’s great and you should gosee it. Didn’t you see thetrailer? What about the bonussneak-peek preview just posted on thewebsite?Tickets are available now.",
            "content_html": "<p>“The Olivia Experiment” opens Friday August 22nd at the Laemmle Music Hall foran exclusive one-week engagement.</p><p>After the 7:20 showing opening night there will be a Q&amp;A with lead actress SkyeNoel, screenwriter Alexandra Kominsaruk, director Sonja Schenk, andcinematographer William MacCollum.</p><p>Saturday the 23rd will feature free CDs with music from the band Small Sails whoare featured on “The Olivia Experiment” soundtrack.</p><p>I know I said it was going to open last week, I was wrong. I know, I amsurprised as you.</p><p>But I’m not wrong when I say I’m in this movie and it’s great and you should gosee it. Didn’t you see the<a href=\"https://www.theoliviaexperiment.com/?page_id=88\">trailer</a>? What about the bonussneak-peek preview just posted on the<a href=\"https://www.theoliviaexperiment.com/?p=472\">website</a>?</p><p><a href=\"https://laemmle.com/films/38411\">Tickets are available now.</a></p>",
            "url": "http://damienburke.com/the-olivia-experiment-opens-aug-22",
            
            
            
            
            
            "date_published": "2014-08-20T01:53:29-07:00",
            "date_modified": "2014-08-20T01:53:29-07:00",
            "author": {
                "name": ""
            }
        },
    
        {
            "id": "http://damienburke.com/the-olivia-experiment-in-a-theater-that-might-be-near-you",
            "title": "\"The Olivia Experiment\" in a theater that might be near you",
            "summary": null,
            "content_text": "“The Olivia Experiment” will open at the Laemmle MusicHall in Beverly Hills on Friday August 15th.It’s a great movie, I’m in it, and you should see it.If you still aren’t convinced, watch the hilarious trailer onYouTube and then send it to allyour friends.",
            "content_html": "<p>“The Olivia Experiment” will open at the <a href=\"https://www.laemmle.com/theaters/4\">Laemmle MusicHall</a> in Beverly Hills on Friday August 15th.</p><p>It’s a great movie, I’m in it, and you should see it.</p><p>If you still aren’t convinced, watch <a href=\"https://www.youtube.com/watch?v=QafV7WHdLHE\">the hilarious trailer onYouTube</a> and then send it to allyour friends.</p>",
            "url": "http://damienburke.com/the-olivia-experiment-in-a-theater-that-might-be-near-you",
            
            
            
            
            
            "date_published": "2014-06-29T04:02:29-07:00",
            "date_modified": "2014-06-29T04:02:29-07:00",
            "author": {
                "name": ""
            }
        },
    
        {
            "id": "http://damienburke.com/another-edition-of-wheres-dukes-gang",
            "title": "Another edition of \"Where's Duke's Gang?\"",
            "summary": null,
            "content_text": "The Petrified Forest openedFriday to a wonderful audience of theatre lovers at Theatre West. Get yourtickets right away or win them by being sending in the first right answer to“Where’s Duke’s Gang?”&lt;",
            "content_html": "<p><a href=\"https://theatrewest.org/onstage/petrifiedforest/\">The Petrified Forest</a> openedFriday to a wonderful audience of theatre lovers at Theatre West. Get yourtickets right away or win them by being sending in the first right answer to<a href=\"https://vine.co/v/MMMeax2D7jQ\">“Where’s Duke’s Gang?”</a></p><iframe class=\"vine-embed\" src=\"https://vine.co/v/MMMeax2D7jQ/embed/simple\" width=\"480\" height=\"480\" frameborder=\"0\"></iframe><p>&lt;</p>",
            "url": "http://damienburke.com/another-edition-of-wheres-dukes-gang",
            
            
            
            
            
            "date_published": "2014-03-22T03:54:58-07:00",
            "date_modified": "2014-03-22T03:54:58-07:00",
            "author": {
                "name": ""
            }
        },
    
        {
            "id": "http://damienburke.com/wheres-dukes-gang",
            "title": "Where's Duke's Gang?",
            "summary": null,
            "content_text": "Name the watering hole and win two free tickets to PetrifiedForest!Email your guess to: staff@theatrewest.org.",
            "content_html": "<p>Name the watering hole and win two free tickets to <a href=\"http://theatrewestarchive.com/archives/petrifiedforest/\">PetrifiedForest</a>!</p><p>Email your guess to: staff@theatrewest.org.</p>",
            "url": "http://damienburke.com/wheres-dukes-gang",
            
            
            
            
            
            "date_published": "2014-03-15T00:06:59-07:00",
            "date_modified": "2014-03-15T00:06:59-07:00",
            "author": {
                "name": ""
            }
        },
    
        {
            "id": "http://damienburke.com/the-petrified-forest",
            "title": "The Petrified Forest",
            "summary": null,
            "content_text": "I am proud to announce I will be playing Ruby in Theatre West’s revival of “ThePetrified Forest.”Come see us Fridays and Saturdays at 8pm or Sundays at 2pm from March 21 throughApril 27, 2014 at Theatre West, 3333 Cahuenga Blvd, Los Angeles CA 90068.Go to Theatre West fortickets and more information.",
            "content_html": "<p>I am proud to announce I will be playing Ruby in Theatre West’s revival of “ThePetrified Forest.”</p><p>Come see us Fridays and Saturdays at 8pm or Sundays at 2pm from March 21 throughApril 27, 2014 at Theatre West, 3333 Cahuenga Blvd, Los Angeles CA 90068.</p><p>Go to <a href=\"https://theatrewest.org/onstage/petrifiedforest/\">Theatre West</a> fortickets and more information.</p><p><img src=\"/images/petrified-forest-postcard-front.jpg\" alt=\"The Petrified Forest\" /></p>",
            "url": "http://damienburke.com/the-petrified-forest",
            "image": "/images/petrified-forest-postcard-front.jpg",
            
            
            
            
            "date_published": "2014-02-16T06:06:04-08:00",
            "date_modified": "2014-02-16T06:06:04-08:00",
            "author": {
                "name": ""
            }
        },
    
        {
            "id": "http://damienburke.com/landing-of-the-urban-rebels",
            "title": "Landing of the Urban Rebels",
            "summary": null,
            "content_text": "I am very happy to be working with iEvolve Productions again, this time understudyingthe role of Harold Childs III in Landing of the Urban Rebels.We are running for two weekends only, December 13th through the 23rd andseveral nights are already sold out. Last year sold out completely and manywere turned away at the door so get your tickets now.My performance dates will be announced soon. Watch this space.",
            "content_html": "<p>I am very happy to be working with iEvolve Productions again, this time understudyingthe role of Harold Childs III in <em>Landing of the Urban Rebels</em>.</p><p>We are running for two weekends only, December 13th through the 23rd andseveral nights are already sold out. Last year sold out completely and manywere turned away at the door so get your tickets now.</p><p>My performance dates will be announced soon. Watch this space.</p><p><img src=\"/images/Landing-of-the-Urban-Rebels-FlyerWhite3.jpg\" alt=\"Landing of the Urban Rebels\" /></p>",
            "url": "http://damienburke.com/landing-of-the-urban-rebels",
            "image": "/images/Landing-of-the-Urban-Rebels-FlyerWhite3.jpg",
            
            
            "tags": ["Landing of the Urban Rebels","theater","iEvolve Productions"],
            
            "date_published": "2012-12-12T06:34:07-08:00",
            "date_modified": "2012-12-12T06:34:07-08:00",
            "author": {
                "name": ""
            }
        },
    
        {
            "id": "http://damienburke.com/the-olivia-experiment-at-the-white-sands-international-film-festival",
            "title": "The Olivia Experiment at the White Sands International Film Festival",
            "summary": null,
            "content_text": "The Olivia Experiment has been chosen bythe White Sands International Film Festival and willscreen Thursday August 23 at noon.If you missed the premiere in LA here is your second chance. Get to your seatsearly, the first voice you hear is mine.",
            "content_html": "<p><a href=\"https://www.theoliviaexperiment.com\">The Olivia Experiment</a> has been chosen bythe <a href=\"http://www.wsiff.com\">White Sands International Film Festival</a> and willscreen Thursday August 23 at noon.</p><p>If you missed the premiere in LA here is your second chance. Get to your seatsearly, the first voice you hear is mine.</p>",
            "url": "http://damienburke.com/the-olivia-experiment-at-the-white-sands-international-film-festival",
            
            
            
            
            
            "date_published": "2012-08-11T05:19:03-07:00",
            "date_modified": "2012-08-11T05:19:03-07:00",
            "author": {
                "name": ""
            }
        },
    
        {
            "id": "http://damienburke.com/olivia-experiment-in-westside-today",
            "title": "Olivia Experiment in Westside Today",
            "summary": null,
            "content_text": "The press is starting to roll. Westside Today did a writeup of The OliviaExperiment yesterday.",
            "content_html": "<p>The press is starting to roll. <em>Westside Today</em> did a writeup of <em>The OliviaExperiment</em> yesterday.</p>",
            "url": "http://damienburke.com/olivia-experiment-in-westside-today",
            
            
            
            "tags": ["film","The Olivia Experiment","press"],
            
            "date_published": "2012-05-15T09:34:30-07:00",
            "date_modified": "2012-05-15T09:34:30-07:00",
            "author": {
                "name": ""
            }
        },
    
        {
            "id": "http://damienburke.com/olivia-experiment-premier",
            "title": "Olivia Experiment premier",
            "summary": null,
            "content_text": "Five pm Thursday June 7th at the Mann Chinese Theater in Hollywood the DancesWith Films film festival will present theworld premier of The Olivia Experiment.I’ve very proud of the bit part I have in this film and had a great time workingon it. Come see it, it’s sure to be a blast!",
            "content_html": "<p>Five pm Thursday June 7th at the Mann Chinese Theater in Hollywood the <a href=\"https://www.danceswithfilms.com/\">DancesWith Films</a> film festival will present theworld premier of <a href=\"https://www.theoliviaexperiment.com/\">The Olivia Experiment</a>.</p><p>I’ve very proud of the bit part I have in this film and had a great time workingon it. Come see it, it’s sure to be a blast!</p>",
            "url": "http://damienburke.com/olivia-experiment-premier",
            
            
            
            "tags": ["festival","trailer","film","The Olivia Experiment"],
            
            "date_published": "2012-05-12T10:21:17-07:00",
            "date_modified": "2012-05-12T10:21:17-07:00",
            "author": {
                "name": ""
            }
        },
    
        {
            "id": "http://damienburke.com/the-return-of-pulp-shakespeare",
            "title": "The Return of \"Pulp Shakespeare\"",
            "summary": null,
            "content_text": "When “Pulp Shakespeare” had its west coast premiere at the Hollywood Fringe it played to sold-out audiences, was critically acclaimed, and awarded Best of Fringe.Now Her Majesty’s Secret Players are bringing it back for a limited run: October 14 through November 13, Friday and Saturday’s at 8pm and Sunday’s at 2pm at the Theatre Asylum, 6320 Santa Monica Blvd., Hollywood CA 90038.In addition to stage-managing I am part of the producing team for this run and I know it’s something I can be proud of and I hope you will be there.Tickets are available now at Plays 411.",
            "content_html": "<p>When “Pulp Shakespeare” had its west coast premiere at the Hollywood Fringe it played to sold-out audiences, was critically acclaimed, and awarded Best of Fringe.</p><p>Now Her Majesty’s Secret Players are bringing it back for a limited run: October 14 through November 13, Friday and Saturday’s at 8pm and Sunday’s at 2pm at the Theatre Asylum, 6320 Santa Monica Blvd., Hollywood CA 90038.</p><p>In addition to stage-managing I am part of the producing team for this run and I know it’s something I can be proud of and I hope you will be there.</p><p>Tickets are available now at Plays 411.</p>",
            "url": "http://damienburke.com/the-return-of-pulp-shakespeare",
            
            
            
            "tags": ["theater","Pulp Shakespeare"],
            
            "date_published": "2011-10-30T06:23:56-07:00",
            "date_modified": "2011-10-30T06:23:56-07:00",
            "author": {
                "name": ""
            }
        },
    
        {
            "id": "http://damienburke.com/inaugural-black-stars-and-doves",
            "title": "Inaugural \"Black Stars and Doves\"",
            "summary": null,
            "content_text": "Saturday was the inaugural performance of the iEvolve Theater Group; “BlackStars &amp; Doves,” an outdoor afternoon of poetry.Thank you to everyone who came out to support this new theater company. Thankyou to my fellow performers for their wonderful work and supportive environment.And thank you to Langston Hughes who provided the marvelous text for me toperform.",
            "content_html": "<p>Saturday was the inaugural performance of the iEvolve Theater Group; “BlackStars &amp; Doves,” an outdoor afternoon of poetry.</p><p>Thank you to everyone who came out to support this new theater company. Thankyou to my fellow performers for their wonderful work and supportive environment.And thank you to Langston Hughes who provided the marvelous text for me toperform.</p><p><img src=\"/images/Black-Stars-and-Doves-postcard.jpg\" alt=\"Black Stars and Doves\" /></p>",
            "url": "http://damienburke.com/inaugural-black-stars-and-doves",
            "image": "/images/Black-Stars-and-Doves-postcard.jpg",
            
            
            "tags": ["theater","iEvolve","Black Stars and Doves"],
            
            "date_published": "2011-09-30T15:21:36-07:00",
            "date_modified": "2011-09-30T15:21:36-07:00",
            "author": {
                "name": ""
            }
        },
    
        {
            "id": "http://damienburke.com/waking-from-the-dream-closes",
            "title": "\"Waking from the Dream\" closes",
            "summary": null,
            "content_text": "“Waking from the Dream” closed over a week ago, but I’m only just nowrecovering. Now is a great time to thank, Barika Croom my co-star, the Velma in“Velma and Manny”; our director Carolyn Blais; writer and producer RochellePerry; and producer Anne Mesa; and the rest of the cast and crew.Thank you. You were amazing!In appreciation, I will restrain myself from making another pun on the title.",
            "content_html": "<p>“Waking from the Dream” closed over a week ago, but I’m only just nowrecovering. Now is a great time to thank, Barika Croom my co-star, the Velma in“Velma and Manny”; our director Carolyn Blais; writer and producer RochellePerry; and producer Anne Mesa; and the rest of the cast and crew.</p><p>Thank you. You were amazing!</p><p>In appreciation, I will restrain myself from making another pun on the title.</p><p><img src=\"/images/waking-from-the-dream-cast-and-crew.jpg\" alt=\"Waking from a Dream cast and crew\" /></p>",
            "url": "http://damienburke.com/waking-from-the-dream-closes",
            "image": "/images/waking-from-the-dream-cast-and-crew.jpg",
            
            
            "tags": ["theater","Waking from the Dream"],
            
            "date_published": "2011-07-03T06:27:41-07:00",
            "date_modified": "2011-07-03T06:27:41-07:00",
            "author": {
                "name": ""
            }
        },
    
        {
            "id": "http://damienburke.com/engine-28-reviews-pulp-shakespeare",
            "title": "Engine 28 reviews Pulp Shakespeare",
            "summary": null,
            "content_text": "Kerry Lengel interviewed the director of Pulp Shakespeare:  Sex and spatter are also key to the appeal of Pulp Shakespeare, whichtransforms Quentin Tarantino’s Pulp Fiction into an Elizabethan tragedy. Itstarted out, in, of all places, on Wikispaces.com, where a page dubbed “PulpBard” crowdsourced the rewrite.  Director Jordan Monsell made some changes of his own for his Fringe version,produced under the moniker Her Majesty’s Secret Players.  “The through-line for both Tarantino and Shakespeare is interesting characterswho like to talk a lot,” says Monsell, whose current reading list includesAbraham Lincoln, Vampire Slayer.  “The underlining themes in Shakespeare are love and death and betrayal,” hesays. “He really knew the human psyche, and that’s immortal.”We had an awesome show tonight and another full house so buy your ticketsnow.",
            "content_html": "<p>Kerry Lengel interviewed the director of Pulp Shakespeare:</p><blockquote>  <p>Sex and spatter are also key to the appeal of Pulp Shakespeare, whichtransforms Quentin Tarantino’s Pulp Fiction into an Elizabethan tragedy. Itstarted out, in, of all places, on Wikispaces.com, where a page dubbed “PulpBard” crowdsourced the rewrite.</p></blockquote><blockquote>  <p>Director Jordan Monsell made some changes of his own for his Fringe version,produced under the moniker Her Majesty’s Secret Players.</p></blockquote><blockquote>  <p>“The through-line for both Tarantino and Shakespeare is interesting characterswho like to talk a lot,” says Monsell, whose current reading list includesAbraham Lincoln, Vampire Slayer.</p></blockquote><blockquote>  <p>“The underlining themes in Shakespeare are love and death and betrayal,” hesays. “He really knew the human psyche, and that’s immortal.”</p></blockquote><p>We had an awesome show tonight and another full house so <a href=\"https://www.hollywoodfringe.org/projects/466\">buy your ticketsnow</a>.</p>",
            "url": "http://damienburke.com/engine-28-reviews-pulp-shakespeare",
            
            
            
            
            
            "date_published": "2011-06-17T17:04:48-07:00",
            "date_modified": "2011-06-17T17:04:48-07:00",
            "author": {
                "name": ""
            }
        },
    
        {
            "id": "http://damienburke.com/tolucan-times-review-of-waking-from-the-dream",
            "title": "Tolucan Times review of \"Waking from the Dream\"",
            "summary": null,
            "content_text": "“[Playwright Rochelle Perry’s] stories, based on true life experiences ‘love,loss, deep soul-searching’ give each act depth, dimension and drama, whichmesmerizes her audience from start to end.”“Waking from the Dream” at the Write Act RepertoryTheater, 7:30pm June 8th, 13th, 14th,15th, 20th, 21st, and 22nd. Tickets are $15. Call (323) 469-3113 forreservations.",
            "content_html": "<p>“[Playwright Rochelle Perry’s] stories, based on true life experiences ‘love,loss, deep soul-searching’ give each act depth, dimension and drama, whichmesmerizes her audience from start to end.”</p><p>“Waking from the Dream” at the <a href=\"https://writeactrep.org/los-angeles.html\">Write Act RepertoryTheater</a>, 7:30pm June 8th, 13th, 14th,15th, 20th, 21st, and 22nd. Tickets are $15. Call (323) 469-3113 forreservations.</p>",
            "url": "http://damienburke.com/tolucan-times-review-of-waking-from-the-dream",
            
            
            
            
            
            "date_published": "2011-06-15T11:19:19-07:00",
            "date_modified": "2011-06-15T11:19:19-07:00",
            "author": {
                "name": ""
            }
        },
    
        {
            "id": "http://damienburke.com/waking-from-the-dream-opening",
            "title": "Waking from the Dream opening",
            "summary": null,
            "content_text": "Come see me in “Velma and Manny,” one of the one-act plays in “Waking from theDream” running for the next two weeks at Write Act Repertory.“Velma and Manny” is a quirky and very funny piece about Velma’s first date, andthe doll she brings along.The rest of the pieces explore living with delusions in various ways. Come earlyfor the art show, Japanese treats and tea, and a different pre-show every night.“Waking from the Dream” at the Write Act RepertoryTheater, 7:30pm June 8th, 13th, 14th, 15th, 20th,21st, and 22nd. Tickets are $15. Call (323) 469-3113 for reservations.",
            "content_html": "<p>Come see me in “Velma and Manny,” one of the one-act plays in “Waking from theDream” running for the next two weeks at Write Act Repertory.</p><p>“Velma and Manny” is a quirky and very funny piece about Velma’s first date, andthe doll she brings along.</p><p>The rest of the pieces explore living with delusions in various ways. Come earlyfor the art show, Japanese treats and tea, and a different pre-show every night.</p><p>“Waking from the Dream” at the <a href=\"https://writeactrep.org/\">Write Act RepertoryTheater</a>, 7:30pm June 8th, 13th, 14th, 15th, 20th,21st, and 22nd. Tickets are $15. Call (323) 469-3113 for reservations.</p><p><img src=\"/images/waking-from-the-dream-velma-and-manny.jpg\" alt=\"Velma and Manny\" /></p>",
            "url": "http://damienburke.com/waking-from-the-dream-opening",
            "image": "/images/waking-from-the-dream-velma-and-manny.jpg",
            
            
            "tags": ["theater","opening","Waking from the Dream","Velma and Manny","Write Act"],
            
            "date_published": "2011-06-13T02:32:11-07:00",
            "date_modified": "2011-06-13T02:32:11-07:00",
            "author": {
                "name": ""
            }
        },
    
        {
            "id": "http://damienburke.com/pulp-shakespeare-opening",
            "title": "Pulp Shakespeare opening",
            "summary": null,
            "content_text": "I will be stage-managing “Pulp Shakespeare” when it opens tomorrow to a sold-outhouse at the Actor’s Circle Theatre. Ten-dollar preview tickets are stillavailable for Sunday at 7pm, after that tickets go up to $15. Buy yourtickets now before they sell out.There is also time to become apatron of HerMajesty’s Secret Players and earn the prestige and swag that patrons of the artsdeserve.“Pulp Shakespeare” at the Actor’s Circle Theatre, 7313 Santa Monica Boulevard,West Hollywood, CA 90046. June 11th at 8pm, June 12 at 7pm, June 18 at 11pm,June 10 at 7pm, June 24 at 7pm, June 25 at 11pm, and June 26 at 3pm. Ticketsavailable at the Hollywood Fringewebsite.",
            "content_html": "<p>I will be stage-managing “Pulp Shakespeare” when it opens tomorrow to a sold-outhouse at the Actor’s Circle Theatre. Ten-dollar preview tickets are stillavailable for Sunday at 7pm, after that tickets go up to $15. <a href=\"https://www.hollywoodfringe.org/projects/466\">Buy yourtickets</a> now before they sell out.</p><p>There is also time to <a href=\"https://www.kickstarter.com/projects/560939718/pulp-shakespeare\">become apatron</a> of HerMajesty’s Secret Players and earn the prestige and swag that patrons of the artsdeserve.</p><p>“Pulp Shakespeare” at the Actor’s Circle Theatre, 7313 Santa Monica Boulevard,West Hollywood, CA 90046. June 11th at 8pm, June 12 at 7pm, June 18 at 11pm,June 10 at 7pm, June 24 at 7pm, June 25 at 11pm, and June 26 at 3pm. Ticketsavailable at the <a href=\"https://www.hollywoodfringe.org/projects/466\">Hollywood Fringewebsite</a>.</p>",
            "url": "http://damienburke.com/pulp-shakespeare-opening",
            
            
            
            "tags": ["theater","Pulp Shakespeare"],
            
            "date_published": "2011-06-10T02:00:58-07:00",
            "date_modified": "2011-06-10T02:00:58-07:00",
            "author": {
                "name": ""
            }
        },
    
        {
            "id": "http://damienburke.com/waking-from-the-dream",
            "title": "Waking from the Dream",
            "summary": null,
            "content_text": "I am really excited to be performing in “Waking from the Dream,” a series ofone-acts by Rochelle Perry. Barika A. Croom and I star in the comedy, “Velma andManny.”Come see us June 8-22nd, Monday through Wednesdays at 7:30pm at the Write ActRepertory Theatre 6128 Yucca St. Hollywood Blvd 90028.(Free parking one block south at 6125 Carlos Ave.)",
            "content_html": "<p>I am really excited to be performing in “Waking from the Dream,” a series ofone-acts by Rochelle Perry. Barika A. Croom and I star in the comedy, “Velma andManny.”</p><p>Come see us June 8-22nd, Monday through Wednesdays at 7:30pm at the <a href=\"https://writeactrep.org\">Write ActRepertory Theatre</a> 6128 Yucca St. Hollywood Blvd 90028.(Free parking one block south at 6125 Carlos Ave.)</p>",
            "url": "http://damienburke.com/waking-from-the-dream",
            
            
            
            "tags": ["theater","Waking from the Dream","Velma and Manny"],
            
            "date_published": "2011-05-26T01:20:26-07:00",
            "date_modified": "2011-05-26T01:20:26-07:00",
            "author": {
                "name": ""
            }
        },
    
        {
            "id": "http://damienburke.com/tiger-closes",
            "title": "Tiger closes",
            "summary": null,
            "content_text": "I’m still a little dazed, but it’s actually over. “Tiger Tiger Burning Bright”had it’s last performance yesterday. It’s been a marvelous journey. Thank you tothe cast, crew, and everyone who came out to see us.",
            "content_html": "<p>I’m still a little dazed, but it’s actually over. “Tiger Tiger Burning Bright”had it’s last performance yesterday. It’s been a marvelous journey. Thank you tothe cast, crew, and everyone who came out to see us.</p>",
            "url": "http://damienburke.com/tiger-closes",
            
            
            
            "tags": ["theater","Tiger Tiger Burning Bright"],
            
            "date_published": "2011-05-23T10:20:07-07:00",
            "date_modified": "2011-05-23T10:20:07-07:00",
            "author": {
                "name": ""
            }
        },
    
        {
            "id": "http://damienburke.com/pulp-shakespeare",
            "title": "Pulp Shakespeare",
            "summary": null,
            "content_text": "Ever wonder what would Pulp Fiction be like if it were written by WilliamShakespeare? Someone did. And it’s pretty awesome.I’ve agreed to stage manage the West Coast premiere of “Pulp Shakespeare; or, ASlurry Tale” at the Hollywood Fringe Festival.Our little merry band, Her Majesty’s Secret Player is in need of patronage.Make a pledge via ourKickstarter.Buy tickets.",
            "content_html": "<p>Ever wonder what would Pulp Fiction be like if it were written by WilliamShakespeare? Someone did. And it’s pretty awesome.</p><p>I’ve agreed to stage manage the West Coast premiere of “Pulp Shakespeare; or, ASlurry Tale” at the Hollywood Fringe Festival.</p><p>Our little merry band, Her Majesty’s Secret Player is in need of patronage.<a href=\"https://www.kickstarter.com/projects/560939718/pulp-shakespeare\">Make a pledge via ourKickstarter</a>.</p><p><a href=\"https://www.hollywoodfringe.org/projects/466\">Buy tickets</a>.</p><iframe frameborder=\"0\" height=\"410px\" src=\"https://www.kickstarter.com/projects/560939718/pulp-shakespeare/widget/video.html\" width=\"480px\"></iframe>",
            "url": "http://damienburke.com/pulp-shakespeare",
            
            
            
            
            
            "date_published": "2011-05-05T01:44:12-07:00",
            "date_modified": "2011-05-05T01:44:12-07:00",
            "author": {
                "name": ""
            }
        },
    
        {
            "id": "http://damienburke.com/tiger-burns-bright-at-stella-adler",
            "title": "Tiger Burns Bright at Stella Adler",
            "summary": null,
            "content_text": "A very kind review from RS Bailey on Curve Wire.  “Tiger Tiger Burning Bright” is well-written and intelligent play with agenuine feel for the underside of life and the everyday people it affects. SamNickens has directed it with a natural fluidity and brought forth somemonumental performances from his cast.  Damien Burke brings a dark internal lure to Clarence.Come see for yourself, Thursday, Friday, and Saturday at 8, Sundays at 3 at theStella Adler Theatre in Hollywood. For tickets and information go toplays411.net/tiger or call 323-960-7740.",
            "content_html": "<p>A very kind review from RS Bailey on Curve Wire.</p><blockquote>  <p>“Tiger Tiger Burning Bright” is well-written and intelligent play with agenuine feel for the underside of life and the everyday people it affects. SamNickens has directed it with a natural fluidity and brought forth somemonumental performances from his cast.</p></blockquote><blockquote>  <p>Damien Burke brings a dark internal lure to Clarence.</p></blockquote><p>Come see for yourself, Thursday, Friday, and Saturday at 8, Sundays at 3 at theStella Adler Theatre in Hollywood. For tickets and information go toplays411.net/tiger or call 323-960-7740.</p><p><img src=\"/images/tiger-tiger-clarence-adelaide-cille.jpg\" alt=\"Clarence and Adelaide withCille\" /></p>",
            "url": "http://damienburke.com/tiger-burns-bright-at-stella-adler",
            "image": "/images/tiger-tiger-clarence-adelaide-cille.jpg",
            
            
            "tags": ["theater","Tiger Tiger Burning Bright","review","curvewire"],
            
            "date_published": "2011-04-22T03:50:28-07:00",
            "date_modified": "2011-04-22T03:50:28-07:00",
            "author": {
                "name": ""
            }
        },
    
        {
            "id": "http://damienburke.com/tiger-tiger-burning-bright-2",
            "title": "Tiger Tiger Burning Bright",
            "summary": null,
            "content_text": "Timothy Clayton called it  “Encapsulating and engaging, the performance flewby.”“The confrontational scenes between Mama and Clarence were particularly engagingand riveting,””. . . a captivating performance, propelled by strong writing and an excellentcast.”See the rest of hisreview.Then come see for yourself at the “surprisingly intimate” Stella Adler Theatre.Performances are Thursday through Saturday at 8 pm and Sunday at 3 pm throughMay 22, 2011. Tickets available at plays411.net/tiger.",
            "content_html": "<p>Timothy Clayton called it  “Encapsulating and engaging, the performance flewby.”</p><p>“The confrontational scenes between Mama and Clarence were particularly engagingand riveting,”</p><p>”. . . a captivating performance, propelled by strong writing and an excellentcast.”</p><p>See the rest of his<a href=\"https://dailytrojan.com/2011/04/20/tiger-tiger-burning-bright-intrigues/\">review</a>.</p><p>Then come see for yourself at the “surprisingly intimate” Stella Adler Theatre.Performances are Thursday through Saturday at 8 pm and Sunday at 3 pm throughMay 22, 2011. Tickets available at plays411.net/tiger.</p><p><img src=\"/images/tiger-tiger-mamas-beautiful-dream.jpg\" alt=\"Mama's beautiful dream\" /></p>",
            "url": "http://damienburke.com/tiger-tiger-burning-bright-2",
            "image": "/images/tiger-tiger-mamas-beautiful-dream.jpg",
            
            
            "tags": ["theater","Tiger Tiger Burning Bright","Stella Adler","reviews"],
            
            "date_published": "2011-04-21T04:02:57-07:00",
            "date_modified": "2011-04-21T04:02:57-07:00",
            "author": {
                "name": ""
            }
        },
    
        {
            "id": "http://damienburke.com/tiger-tiger-burning-bright-opening-soon",
            "title": "Tiger Tiger Burning Bright opening soon",
            "summary": null,
            "content_text": "I’m really excited about this show. We open Thursday.Here’s a photo of our amazing cast on set:To make reservations, or for more information goto Plays 411.",
            "content_html": "<p>I’m really excited about this show. We open Thursday.</p><p>Here’s a photo of our amazing cast on set:</p><p><img src=\"/images/tiger-tiger-cast-photo.jpg\" alt=\"Cast of &quot;Tiger Tiger Burning Bright&quot;\" /></p><p>To make reservations, or for more information goto Plays 411.</p><p><img src=\"/images/tiger-tiger-flyer.jpg\" alt=\"&quot;Tiger Tiger Burning Bright&quot; flyer\" /></p>",
            "url": "http://damienburke.com/tiger-tiger-burning-bright-opening-soon",
            "image": "/images/tiger-tiger-cast-photo.jpg",
            
            
            
            
            "date_published": "2011-04-10T13:55:56-07:00",
            "date_modified": "2011-04-10T13:55:56-07:00",
            "author": {
                "name": ""
            }
        },
    
        {
            "id": "http://damienburke.com/meet-the-cast-of-tiger-tiger-burning-bright",
            "title": "Meet the Cast of Tiger Tiger Burning Bright",
            "summary": null,
            "content_text": "Richard Reliford shot and edited this promo video introducing our cast.I (obviously) didn’t know what to say at the time. I would have liked to saymore about my character, Clarence Morris; also known as tiger cat, the man ofthe house, the most handsome man around New Orleans, Mama’s beautiful dream, Mr.Book Man, Mama’s most important pretend, shadow, hustler, thief, hustling thief,thieving hustler, lover boy of the world, storybook child, candyman, andtwilight.",
            "content_html": "<p>Richard Reliford shot and edited this promo video introducing our cast.</p><iframe title=\"Tiger Tiger Burning Bright 'Meet the Cast' Promo\" width=\"480\" height=\"390\" src=\"https://www.youtube.com/embed/lZknYPYzNq4?rel=0\" frameborder=\"0\" allowfullscreen=\"\"></iframe><p>I (obviously) didn’t know what to say at the time. I would have liked to saymore about my character, Clarence Morris; also known as tiger cat, the man ofthe house, the most handsome man around New Orleans, Mama’s beautiful dream, Mr.Book Man, Mama’s most important pretend, shadow, hustler, thief, hustling thief,thieving hustler, lover boy of the world, storybook child, candyman, andtwilight.</p>",
            "url": "http://damienburke.com/meet-the-cast-of-tiger-tiger-burning-bright",
            
            
            
            "tags": ["trailer","theater","Tiger Tiger Burning Bright"],
            
            "date_published": "2011-03-13T17:27:42-07:00",
            "date_modified": "2011-03-13T17:27:42-07:00",
            "author": {
                "name": ""
            }
        },
    
        {
            "id": "http://damienburke.com/stanley-steemer-roll-call",
            "title": "Stanley Steemer \"Roll Call\"",
            "summary": null,
            "content_text": "Last Tuesday I had the pleasure of shooting a hilarious new Stanley Steemercommercial called “Roll call.” Look for it on a TV near you starting in the nextfew weeks.In the meantime here’s a picture of me with the lovely and talented fellow BBRclient Lesley Surdi.",
            "content_html": "<p>Last Tuesday I had the pleasure of shooting a hilarious new Stanley Steemercommercial called “Roll call.” Look for it on a TV near you starting in the nextfew weeks.</p><p>In the meantime here’s a picture of me with the lovely and talented fellow BBRclient Lesley Surdi.</p><p><img src=\"/images/stanley-steemer-employees.jpg\" alt=\"Stanley Steemer Employees\" /></p>",
            "url": "http://damienburke.com/stanley-steemer-roll-call",
            "image": "/images/stanley-steemer-employees.jpg",
            
            
            "tags": ["shoot","commercial","still","Stanley Steemer"],
            
            "date_published": "2011-03-12T18:06:09-08:00",
            "date_modified": "2011-03-12T18:06:09-08:00",
            "author": {
                "name": ""
            }
        },
    
        {
            "id": "http://damienburke.com/tiger-tiger-burning-bright-opens-at-the-stella-adler-on-april-14",
            "title": "\"Tiger Tiger Burning Bright\" Opens at the Stella Adler on April 14",
            "summary": null,
            "content_text": "From the press release:“Tiger Tiger Burning Bright” (1962) is set in New Orleans at midcentury. It isthe story of a troubled family. Although the family is Black, its conflicts arenot race specific (as was noted by the New York Times review of the play’soriginal Broadway production). It is about what occurs when dreams becomedelusions, sometimes through deliberate design.They’re not destitute. In fact, their home is nearly paid off. Clarenceostensibly works for the telegraph company, achieving a series of advancementsin pay. In point of fact, his money comes from somewhat more sinisteractivities, not unrelated to his good looks.Mama is the old-fashioned matriarch of the family. She is in perpetual mourningfor son George, reported to have been killed during his military duty.Clarence’s younger brother, Dan, wants to marry Adelaide, the lovely local girlwho is regularly around their home. But Adelaide has an eye for the betterlooking Clarence.His kid sister, Cille, has a gift for seeing right through things to the heartof what they really are. It comes with a price, as she is afflicted withhorrible migraines.Stirring up the stew are their two new neighbors: Celeste, who also noticesClarence; and Dewey, who takes an immediate shine to Cille. There’s also thecorrupt local preacher, who has a terrible hold on Clarence.It’s a family held together with a web of deceptions and lies. When truthsbecome known, can the family survive? Clarence is a young man on the brink: Willhis current course destroy him, or is there hope for a life beyond what’s healways known? Can Adelaide redeem him? (In a twist, if she can redeem him, itwould be with the love of a bad woman, rather than the love of a good one.) Whatwill they all do?Peter S. Feibleman is the playwright. He wrote the play “Cakewalk,” about hisromance with the much older Lillian Hellman. He also wrote the feature film“Ensign Pulver,” and contributed to the screenplay of “Reds.” He wrote episodesof the TV series “Columbo” and several novels, including “A Place WithoutTwilight,” “Daughters of Necessity,” and “Strangers and Graves.”Sam Nickens directs. He has helmed a number of shows for Upward BoundProductions, including last season’s critically acclaimed “The Good Negro,” “NoPlace to Be Somebody,” and “The Awakening.”His cast for “Tiger Tiger Burning Bright” includes (in alphabetical order)DeShawn Barnes, Damien Burke, Barika Croom, Carl Crudup, Janai Dionne, GilbertHancock, Regina Randolph, Richard Reliford and Collin St. Die.Stage Manager: Cary Thompson. Sound design: Sam Nickens. Wardrobe: Naila AladdinSanders. Lighting: Mylika Davis.“Tiger Tiger Burning Bright” explores what it means for a man and a family tolive with the truth rather than what seems comfortable.WHAT: “Tiger Tiger Burning Bright.” A play.WHO: Written by Peter S.  Feibleman. Directed by Sam Nickens. Presented byUpward Bound Productions.WHERE: Stella Adler Theatre, on the main stage, 6773 Hollywood Blvd., Hollywood,CA 90028. Low-priced validated parking is available at the nearby Hollywood andHighland center.WHEN: April 14- May 22,2011. Thurs.-Sat. at 8, Sun. at 3.ADMISSION: $20. Seniors, students, members of performing arts unions (with ID.),groups of eight or more, $10 (Use promotional code “BEST”).  RESERVATIONS: (323)960-7740.ONLINE TICKETING: https://www.Plays411.com/tigerPublicist: Philip Sokoloff PO Box 94387 Pasadena CA 91109-4387(626) 683-9205 fax (626) 683-9172 showbizphil@sbcglobal.netPDF Pressrelease",
            "content_html": "<p>From the press release:</p><p>“Tiger Tiger Burning Bright” (1962) is set in New Orleans at midcentury. It isthe story of a troubled family. Although the family is Black, its conflicts arenot race specific (as was noted by the New York Times review of the play’soriginal Broadway production). It is about what occurs when dreams becomedelusions, sometimes through deliberate design.</p><p>They’re not destitute. In fact, their home is nearly paid off. Clarenceostensibly works for the telegraph company, achieving a series of advancementsin pay. In point of fact, his money comes from somewhat more sinisteractivities, not unrelated to his good looks.</p><p>Mama is the old-fashioned matriarch of the family. She is in perpetual mourningfor son George, reported to have been killed during his military duty.</p><p>Clarence’s younger brother, Dan, wants to marry Adelaide, the lovely local girlwho is regularly around their home. But Adelaide has an eye for the betterlooking Clarence.</p><p>His kid sister, Cille, has a gift for seeing right through things to the heartof what they really are. It comes with a price, as she is afflicted withhorrible migraines.</p><p>Stirring up the stew are their two new neighbors: Celeste, who also noticesClarence; and Dewey, who takes an immediate shine to Cille. There’s also thecorrupt local preacher, who has a terrible hold on Clarence.</p><p>It’s a family held together with a web of deceptions and lies. When truthsbecome known, can the family survive? Clarence is a young man on the brink: Willhis current course destroy him, or is there hope for a life beyond what’s healways known? Can Adelaide redeem him? (In a twist, if she can redeem him, itwould be with the love of a bad woman, rather than the love of a good one.) Whatwill they all do?</p><p>Peter S. Feibleman is the playwright. He wrote the play “Cakewalk,” about hisromance with the much older Lillian Hellman. He also wrote the feature film“Ensign Pulver,” and contributed to the screenplay of “Reds.” He wrote episodesof the TV series “Columbo” and several novels, including “A Place WithoutTwilight,” “Daughters of Necessity,” and “Strangers and Graves.”</p><p>Sam Nickens directs. He has helmed a number of shows for Upward BoundProductions, including last season’s critically acclaimed “The Good Negro,” “NoPlace to Be Somebody,” and “The Awakening.”</p><p>His cast for “Tiger Tiger Burning Bright” includes (in alphabetical order)DeShawn Barnes, Damien Burke, Barika Croom, Carl Crudup, Janai Dionne, GilbertHancock, Regina Randolph, Richard Reliford and Collin St. Die.</p><p>Stage Manager: Cary Thompson. Sound design: Sam Nickens. Wardrobe: Naila AladdinSanders. Lighting: Mylika Davis.</p><p>“Tiger Tiger Burning Bright” explores what it means for a man and a family tolive with the truth rather than what seems comfortable.</p><p>WHAT: “Tiger Tiger Burning Bright.” A play.<br />WHO: Written by Peter S.  Feibleman. Directed by Sam Nickens. Presented byUpward Bound Productions.<br />WHERE: Stella Adler Theatre, on the main stage, 6773 Hollywood Blvd., Hollywood,CA 90028. Low-priced validated parking is available at the nearby Hollywood andHighland center.<br />WHEN: April 14- May 22,2011. Thurs.-Sat. at 8, Sun. at 3.<br />ADMISSION: $20. Seniors, students, members of performing arts unions (with ID.),groups of eight or more, $10 (Use promotional code “BEST”).  RESERVATIONS: (323)960-7740.<br />ONLINE TICKETING: https://www.Plays411.com/tiger</p><p>Publicist: Philip Sokoloff<br /> PO Box 94387<br /> Pasadena CA 91109-4387</p><p>(626) 683-9205<br /> fax (626) 683-9172<br /> showbizphil@sbcglobal.net</p><p><a href=\"images/tiger-tiger-press-release.pdf\">PDF Pressrelease</a></p>",
            "url": "http://damienburke.com/tiger-tiger-burning-bright-opens-at-the-stella-adler-on-april-14",
            
            
            
            
            
            "date_published": "2011-02-26T08:43:41-08:00",
            "date_modified": "2011-02-26T08:43:41-08:00",
            "author": {
                "name": ""
            }
        }
    
    ]
}
